{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title"},{"path":["body"],"id":"body","weight":1,"src":"body"}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Projects","n":1},"1":{"v":"\n# Projects\n\n","n":0.707}}},{"i":2,"$":{"0":{"v":"Set up PARA","n":0.577},"1":{"v":"\n# Set up PARA\n\n- [x] Establish projects\n    - [x] Pull out all actionable notes from [[cerebrarium]]\n    - [x] put it all in [[proj]]\n        - Do not think about the hierarchy or schema just yet. Just do it.\n    - [x] Also create new entries for projects that you have thought about but never put into action.\n- [x] tag statuses of all projects\n- [x] tagging vs. categorization by hierarchy on projects\n    - maybe time for a retrospect on this topic\n\n\n## Notes\n\n2021-03-27 12:08 AM\n- The notion of `area` in the PARA method seems very vague.\n- It almost feels like it's there to make the word `PARA` more catchy and roll off your tongue... A bit artificial? loosey goosey?\n- It is clear that something not actionable (not a project) is an area, but how do you distinguish it from resources?\n    - Is an `area` simply a think wrapper around `projects` and `resources`?\n    - A categorization? \n- Will have to ponder a bit more on this after I've established all my `projects`\n\n2021-03-27 12:49 AM\n- Dendron's hierarchical way of organizing notes naturally eliminate the need to artificially set up the `area`s in PARA\n- Simply not thinking about a rigid structure for PARA makes it much more easier to grasp the idea.\n\n2021-04-15 3:37 AM\n- It is a bit hard trying to navigate between projects.\n- Using a flat hierarchy of `projects.*` is simple, but in the graph view everything is overlapping.\n    - There is no distinction between _active_ and _pending_ projects.\n    - Projects need to be archived to make room for other projects to become visible.\n- The alternative is to ditch tagging with `tags.projects.[active|pending]` and simply making a `projects.active.*` hierarchy for currently active projects and `projects.pending.*` for planned projects.\n    - Maybe also just have a local `projects.archived.*` hierarchy? I need to think about this.\n\n2021-07-04 14:40\n- A lot of time has past, and I got distracted by a lot of the minutiae of life during that time.\n- [[Tagging is broken|ext.tagging-is-broken]], and [[this article|ext.a-complete-guide-to-tagging-for-personal-knowledge-management]] goes deep into how tagging should work.\n    - For now, I think this hierarchical project status tagging is sufficient.\n    - Calling this done and will come back to this for incremental improvements.\n","n":0.053}}},{"i":3,"$":{"0":{"v":"Pachypus Prep","n":0.707},"1":{"v":"# Pachypus purchase preparation\n\n> **Prepare everything you need for rooting an [[Operculicarya Pachypus|cerebrarium.botany.plants.operculicarya.pachypus]] before purchasing.**\n> Start time: 2021-03-28\n> End time: 2021-04-03\n\n## Tasks\n\n- [x] List up some lingering questions\n- [x] Answer them yourself\n- [x] List up gardening tools / chemicals / hardware I need before rooting.\n- [x] Order said products\n- [x] Study up on how to select a healthy plant\n- [x] Study how rooting is done\n\n## Notes\n\n- stuff that I need on top of my head\n  - [x] trowel\n    - [x] plastic, scoopy type\n    - [x] stainless steel\n  - [x] sieve\n  - [ ] another heating pad\n  - [x] large plastic pot that can cover the transparent one\n  - [ ] hydrogen peroxide\n  - [x] maenadel\n  - [x] luton\n  - [x] kiyonaru\n\n- Some questions I need to answer\n  - [x] What kind of pot do I want to use?\n  - [x] What kind of soil mixture do I want to use?\n  - [ ] Should I build a greenhouse?\n  - [ ] How do I select a good healthy pachypus?\n  - [ ] What do I do immediately after I purchase it?\n  - [ ] Where do I want to keep it while it is rooting?\n  - [ ] When do I start watering it?\n  - [ ] How do I know it's doing well?\n  - [ ] When can I repot it?\n\nQ. What kind of pot do I want to use?\n\n- I currently have a transparent pot that has a lot of slit in it\n\n![](/assets/images/2021-03-29-23-35-19.png)\n\n- It is branded and sold as **Mesh pot** here, and interestingly it has a conical elevation inside which helps the plant to be placed for ideal rooting.\n- I purchased it when I first though I would be rooting a failed pachypus, but I ended up not planting it because it had little to no sign of life left in it.\n- I recently learned that using a transparent pot will promote moss growth inside the pot, which is NOT good for the plant (at least for plants from Madagascar I think).\n- I have seen some people use this exact pot for rooting, but also have an outer pot that fits around it so that it blocks light.\n- This I think is a good solution.\n- Another option for me is to use a non-transparent perforated pot like these:\n\n![](/assets/images/2021-03-29-23-42-18.png)\n\n- These are modular pots. They come as perforated sheets and you also get a gridded bottom plate and put it together yourself.\n\n- Looks like they most of them are already assembled if you are getting them retail.\n\n- This eliminates the need for a secondary pot to block sunlight into the roots, but the downside is that I have no way to check inside the soil if I wanted to.\n\n- It also looks harder to wrap around with a heated pad, so if I go with this pot I need an indoor greenhouse. (maybe I need one anyways)\n\n- How does air circulation affect root growth?\n  - Prevents waterlogging.\n\n- So, in short I want a pot that can:\n  1. let the roots breathe\n  2. let me check the roots with ease\n  3. block sunlight in order to prevent moss growth\n\nI will use the transparent `mesh pot` I own, and also purchase a slightly larger modular perforated pot to enclose the transparent mesh pot. This way I can let the roots aerate, check the status of the roots by pulling it out of the outer pot, and also keep the modular pot on the outside to block sunlight.\n\n2. What kind of soil mixture do I want to use?\n\n- Most sources on the internet tells me I need a **well draining soil**\n- Also, not everyone seems to be using the same thing. I guess it is more of an trail-and-error.\n- According to some people in the Korean caudex community recommends 산야초.\n\n![](/assets/images/2021-03-30-00-01-43.png)\n\n- Now that I look at some of the caudices I've purchased from a shop, a lot of them are potted in this mixture. Both small and medium grain.\n\n![](/assets/images/2021-03-30-00-02-15.png)\n![](/assets/images/2021-03-30-00-02-35.png)\n\n- What goes in it?\n  - Satsuma soil (사스마토)\n  - Sterilized \"baked\" soil (소성토)\n  - Hyuga pumice (휴가토, 난석)\n  - Kanuma soil (녹소토)\n  - Pumice (경석)\n\n- I think it is a safe bet to try out 산야초 and mix a bit of larger bits of akadama, kanuma, and a bit of compost with a few scoops of magamp K. maybe some volcanic soil too?\n\n- Either way, I need to order a bag of 산야초\n\n- While we are on the topic of soil, I also need a proper trowel, and a sieve.\n\nQ. Should I build a greenhouse?\n\n- I thought about this a lot, but I don't think I need it. At least not yet.\n  - The shop I am planning to purchase the imported pachypus has posted a photo of the plants today and they seem to have planted them right after import in order to condition them to the local climate.\n    - They will be unpotted to let the customers check root conditions.\n  - I have heard that they have already cut the unhealthy parts of the root and confirmed it's health\n  - It's getting warmer outside, so keeping the temperature high is less of an issue.\n  - A lot of information online leads me to think that high humidity and high temperature is key to successful rooting of an imported plant, but there are a few things to consider here\n    - Opeerculicarya Pachypus is endemic to Madagascar, where you do have high heat, but not much high humidity.\n    - Making an artificially humid environment seems to be a forced way of promoting new root growth.\n      - This makes the success rate unpredictable.\n      - This is not necessary for a relatively healthy plant.\n      - I theorize that it is a very extreme measure to take when you know the plant is slowly withering, and want to force new roots so that it can be conditioned again to revive.\n        - This makes _starting with a healthy plant_ from the beginning more important\n\nQ. How do I select a good healthy pachypus?\n\n- If the caudex has white spotty marks, it's likely that it's rotting inside.\n  - Less of a problem if it's already rooted.\n  - Try to find something that has the least white spots on the body.\n- Surviving green leaves are a sign that the caudex is still somewhat healthy.\n- Hints of green on the caudex when sprayed means it is healthy.\n- The larger the plant, the more stronger it is.\n  - Thus more likely to have survived the stress while importing.\n- There are already roots\n- `Power tank` is not cut.\n- It hasn't been long since it was imported.\n- If you scratch the skin off, it's green.\n- The trunk's skin has a bit of sheen to it.\n\nQ. ~~What do I do immediately after I purchase it?~~\nQ. ~~Where do I want to keep it while it is rooting?~~\nQ. ~~When do I start watering it?~~\nQ. ~~How do I know it's doing well?~~\nQ. ~~When can I repot it?~~\n\n## Post-mortem\n\n- Well, it happened. I did purchase a bare root stock of a Pachypus.\n- I spent two hours chatting with the owner and trying to pick which one I wanted.\n- What was unusual for this kind of bulk sale of bare root stocks, is that the owner insisted that they show the cross section of the root to guage how healthy the stock is.\n  - They did not refuse to sell it if its health was suboptimal, but it was a very nice gesture for them to show everyone what they are getting into.\n- I have brought my purchase home and immediately potted them.\n  - The details I will write in another note.\n- I spent more than I would have liked to, but I couldn't have had a better first experience for bare root stock purchase. Well worth the price tag.\n  - To clarify, it was a bargain considering the health of the stock and the extra mile they went to clarify it. I simply spent over my budget.\n\n","n":0.028}}},{"i":4,"$":{"0":{"v":"Accidental Contraptions","n":0.707},"1":{"v":"\n## Notes\n2021-07-04 14:52\n- This is something that I gave myself until end of Q1 to get to a point where I can make prints for 2-3 finished pieces, but fell off for other things.\n- This is worth getting back to as art is currently something I am active trying to work on.\n- Let's get back to this during July and set out a plan to move this forward.\n\n\n2021-08-07 22:22\n- _finishing_, or declaring a drawing / art project as _finished_ is important not because it is pushing you out of your comfort zone / having discipline / drive or anything. It is important because it lets your mind to flush out the lingering doubts and worries that you had with your last piece and focus on other things. (which then leads to spending more quality time on things that will improve your skills or push you out of your comfort zone, etc.)\n  - I guess the principle of _shutting down_ talked about in [[Deep Work|ext.deep-work]] applies here as well, in a more generalized sense.\n  - So while having concurrent projects could mean you are exploring various pathways, it also means that each of them are being a distraction.\n    - At least it seems like this is the case for me.\n- this is something that has been lingering around for a while just nagging me for attention. This should probably be fixed.\n  - In the spirit of [[Deep Work|ext.deep-work]], I should at least\n    - Define a clear way of how to proceed when I decided to pick it back up, or\n    - Get to actually working on it, until I have a tangible deliverable.\n      - Incremental, but logically separated chunks of goals.\n- My original plan at the end of 2020 was to get 4-5 pieces done and go through actually printing them in small scale by Q1.","n":0.057}}},{"i":5,"$":{"0":{"v":"HANDS","n":1},"1":{"v":"\n# Project HANDS\n\n## Goals\n- Practice drawing hands.\n- Do it pedantically, analytically, and exhaustively.\n\n## Tasks\n- [ ] Do a test run of ~~L00000~~\nL11111 and find a repeatable pattern to follow for the rest of the poses.\n\n## Logs\n2021-07-20 14:06\n- Starting off with L00000\n- Reference?\n  - My hands.\n  - A 3d posing software.\n  - random pics from the internet.\n- real references over 3d renders / pics.\n\n2021-07-21 20:21\n- Just realized starting with L11111 would give me a better idea of what's going on in the hand. So change of plans. starting with [[proj.HANDS.L.11111]].\n- Do I start with a tutorial? I have no idea how to draw hands.\n- I first want to take a picture and draw over it to get a sense of what I can do without handholding (heh).\n\n2021-07-21 22:32\n- Check out https://artres.xyz/post/13-handy-resources-for-drawing-hands-/\n\n2021-07-22 00:44\n- pedantry should be followed by a reward.\n- idea: after practicing and analyzing each hand pose, incorporate it into a fun drawing or a design.\n  - try anything on it.\n  - e.g.) for F11111, I could draw the hand, and make it into a tattoo design with whatever detail / style.\n  - I think this is a good way to explore art styles.\n\n2021-07-25 17:23\n- [[Structuralization|ext.six-structures-of-drawing#^4vaguD59043v0Dla]] of the hand\n  - cylinders\n    - fingers\n    - arm\n  - spheres\n    - joints\n    - wrist\n    - tip of the finger\n  - plates / box\n    - palm / body of the hand\n","n":0.067}}},{"i":6,"$":{"0":{"v":"L","n":1},"1":{"v":"\n## THE LEFT HAND\n\n","n":0.5}}},{"i":7,"$":{"0":{"v":"11111","n":1}}},{"i":8,"$":{"0":{"v":"00000","n":1}}},{"i":9,"$":{"0":{"v":"Inbox","n":1},"1":{"v":"\n# Inbox\n\n> A giant dumping ground where I put all the things I want to save but don't have time to give a proper hierarchy.\n> I try to leave a simple note on each inbox item so you have a context to work with when you get to it later.\n> These notes do not persist. Once they are acted upon, it will have served it's purpose and it will be deleted.\n\n## What comes in\n\n## What goes out\n","n":0.114}}},{"i":10,"$":{"0":{"v":"Reading","n":1},"1":{"v":"\n## Read These Later\n\n- Ray Dalio, Principles\n  - https://www.principles.com/\n  - Book about making decisions. Kevin's recommendtaion.\n- Andy Matuschak\n  - [note-writing systems](https://notes.andymatuschak.org/zhmLXArqiCMDr9Q13ViqN3hh3SmrKzjQxWAr)\n  - [Taxonomy of note types](https://notes.andymatuschak.org/z6f6xgGG4NKjkA5NA1kDd46whJh2Gt5rAmfX)\n  - [note-writing livestream](https://www.youtube.com/watch?v=DGcs4tyey18)\n- Daniel Doyon (Readwise), How to Tag Your Highlights While You Read\n  - https://blog.readwise.io/tag-your-highlights-while-you-read/\n  - Related to [[ext.tagging-is-broken]]\n- Jan Chipchase, Hidden in Plain Sight\n  - https://www.amazon.com/Hidden-Plain-Sight-Extraordinary-Tomorrows/dp/0062125699/ref=sr_1_1?s=books&ie=UTF8&qid=1360265898&sr=1-1&keywords=chipchase\n  - A book about observation\n- Austin Z. Henley, Why I prefer making useless stuff\n  - https://web.eecs.utk.edu/~azh/blog/makinguselessstuff.htm\n  - HN post on programming. light read.\n- Walter Roosli, Pachypodien in Madagaskar\n  - https://www.nhbs.com/pachypodiums-in-madagascar-book\n  - Gore Plant Seoul recommendation. Nice reference book.\n- Dan Nessler, How to apply a design thinking, HCD, UX or any creative process from scratch\n  - https://medium.com/digital-experience-design/how-to-apply-a-design-thinking-hcd-ux-or-any-creative-process-from-scratch-b8786efbf812\n  - blog post about the Double Diamond.\n- Maggie Appleton\n  - [Digital Gardeners repo](https://github.com/MaggieAppleton/digital-gardeners)\n  - [A Brief History & Ethos of the Digital Garden](https://maggieappleton.com/garden-history)\n- [metaself](http://www.metaself.org/index.php)\n- [The War of Art](https://www.amazon.com/dp/B007A4SDCG/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1)\n","n":0.085}}},{"i":11,"$":{"0":{"v":"Do","n":1},"1":{"v":"\n> Items that are unambiguous and actionable but not significant enough to be a project.\n\n## Items\n- [ ] Clean up [[ref.dev]].\n  - They were refactored from [[cerebrarium]], and needs to be in a state where every bit of knowledge is immediately useful on lookup.\n  - [ ] Remove direct links to stuff that you are never going to use.\n  - [ ] Process them into your own words.\n","n":0.121}}},{"i":12,"$":{"0":{"v":"Backlog","n":1},"1":{"v":"\n## Backlog\n- Items that:\n  - Don't have enough context to become a project.\n  - That I don't currently have bandwidth to look into.\n  - That I do have interest in coming back.s\n\n## Items\n","n":0.174}}},{"i":13,"$":{"0":{"v":"External Information","n":0.707},"1":{"v":"\n> Books, articles, videos, etc. that I consumed and applied minimal to no processing to.\n\n- The notes in this hierarchy are notes I took while reading a book, an article, watching a video, etc.\n- Essentially all media and resources in the external world that I have decided to actively consume and record the essence of.\n- The content of the notes are either exact copies of the information I got from the source (for easier lookup), minimally processed or summarized.\n- Excluding the subconscious effect of recording only what is important to me, all notes will not contain thoughts of my own.\n\n## Rules\n### 1. Don't categorize primarily by content type.\n  - This means no deep hierarchy going into what the source is.\n  - It doesn't matter if it was a book or a video. What matters is that I have actively consumed it, and is recorded here to be potentially queried in other places.\n  - If the category is important (it rarely is), lightly note it within the note content.\n  - Good:\n    - `ext.deep-work`\n    - `ext.dr-k-two-solutions-to-anxiety`\n  - Bad:\n    - `ext.book.nonfiction.productivity.deep-work`\n    - `ext.video.youtube.mental-health.drk.two-solutions-to-anxitey`\n\n### 2. There should be one entry point to one source of information.\n  - A source of information should have a single entry point that you can reliably look up.\n  - If the length of the note becomes too unwieldy, divide it up into children notes (sparingly).\n  - Good:\n    - Notes for the book `Deep Work` in `ext.deep-work`\n  - Bad:\n    - Notes for the book `Deep Work` in `ext.deep-work`, your daily journal, and some other note.\n\n### 3. Don't be compelled to divide everything into chapters and ideas.\n  - The primary goal of this hierarchy is _to record_.\n  - Being atomic with your notes has [values](https://notes.andymatuschak.org/Evergreen_notes_should_be_atomic?stackedNotes=z8AfCaQJdp852orumhXPxHb3r278FHA9xZN8J), but I claim that the overhead is high in the context of this hierarchy.\n    - You are spending time ahead trying to come up with a sensible hierarhcy before knowing how the content will be used elsewhere.\n  - If there is already a very well defined hierarchy within the source of information, feel free to take that structure and apply it to the notes if necessary.\n  - The single reason you would spend time to create a deep structure in these notes, is to _make looking up more easy_.\n- Good:\n  - Dividing `ext.deep-work` into `ext.deep-work.rule-1` ~ `ext.deep-work.rule-4` because the book already does it and the content is long enough to deserve it's own page.\n- Bad:\n  - Dividing `ext.some-random-article` into `ext.some-random-article.ideas.stuff` because you identified multiple ideas within the source that deserves some separation.\n\n### 4. Reference the notes that gets written in this hierarchy as soon as possible in [[cerebrarium]], where it is relevant.\n  - The notes here are intentionally stripped of deep context in which I have taken it.\n  - For these notes to have a purpose, they will have to be used in forming my own thoughts in my [[cerebrarium]].\n    - Try to index them where it is applicable as soon as possible so that the context doesn't get lost. Don't let the effort of writing notes here go to the void.\n","n":0.044}}},{"i":14,"$":{"0":{"v":"The Intelligent Use of Space","n":0.447},"1":{"v":"\nSource: https://adrenaline.ucsd.edu/Kirsh/Articles/Space/AIJ1.html\n","n":0.707}}},{"i":15,"$":{"0":{"v":"Tagging Is Broken","n":0.577},"1":{"v":"\nSource: https://fortelabs.co/blog/tagging-is-broken/\n\n- using tags as a primary source of organization means you have to decide _for every note_ which tag(s) you want to use.\n    - You are relying on memorizing all the tags you have made.\n    - This a lot of up-front cost.\n\n- We offload some of our cognitive processing onto our environment, and this is much more capable of storing information than our brain does.\n    - e.g.) method of loci, memory palace.\n- This concept is called _stigmergy_ (stigmergic cognition)\n- Tags ignore stigmergy and force us to think about notes in abstract ways.\n\n- In PKM, a constant temptation is to overorganize\n    - too many categories\n    - too many subdivisions\n\n- As number of tags grew arithmetically, complexity grows geometrically.\n    - A system that encourages tags is giving you explicit affordance to increase complexity.\n\n- Tags were good when the cost of running a search was costly.\n    - In these days, running a search is not a costly operation.\n    - Thus the cost of tagging is almost completely wasted because almost the entire body of text could be broken into indexable, searchable \"tags\" that can be retrieved almost instantaniously.\n","n":0.073}}},{"i":16,"$":{"0":{"v":"Six Structures of Drawing","n":0.5},"1":{"v":"\nsource: https://www.youtube.com/watch?v=6T_-DiAzYBc\n\n- Six steps on how you can learn to draw anything and provide you with a better understanding of form, design, and structure.\n\n1. Structuralization ^4vaguD59043v0Dla\n    - Basics. \n    - Learning to draw the simple shapes.\n    - Learning how to draw them, cluster them, combine them intuitively.\n    - Spacial awareness.\n    - Good sense of believability.\n\n2. Manipulation\n    - (Shape) manipulation.\n    - Taking the primitives and learning how to \n      - bend and twist them.\n      - squash them\n    - Manipulating contours, sections, edges.\n\n3. Observation\n    - We don't need to first educate what's going on in an object to draw it. (e.g. we don't need to know everything about human anatomy to draw a human figure).\n      - With the previous steps, you can structuralize and manipulate simple shapes after observing what's in front of your eyes to come up with something believable, that resembles the object.\n    - Mannequin-ize the stuff you see.\n\n4. Education\n    - Now we are trying to educate ourselves about the things we observed and approximated.\n    - e.g. studying the underlying muscles / bones after approximating what you've observed to come up with a human figure drawing.\n\n5. Imitation\n    - Learn from peers to what visual language they are using to structuralize / manipulate objects.\n    - Building the catalogue of the art styles of other artists that you admire or your eyes are drawn to. Learning what they are doing.\n      - In turn slowly developing a style of your own.\n    - Analyze\n\n6. Imagination\n    - Coming up with something of your own with everything you've done in the previous steps. from scratch.\n","n":0.062}}},{"i":17,"$":{"0":{"v":"Progressive Summarization","n":0.707},"1":{"v":"\nsource: https://fortelabs.co/blog/progressive-summarization-a-practical-technique-for-designing-discoverable-notes/\n","n":0.707}}},{"i":18,"$":{"0":{"v":"Minimalist Journaling","n":0.707},"1":{"v":"\n# Minimalist Journaling: A Fun and Effective Tool for Tremendous Habit Change\n\nsource: https://betterhumans.pub/draft-how-to-hack-your-brain-to-achieve-consistency-that-lasts-7f5fdc520d28\n\n- \"The key to pursuing excellence is to embrace an organic, long-term learning process, and not to live in a shell of static, safe mediocrity.\" - Josh Waitzkin.\n\n- A common trait of successful people: consistency.\n- Having motivation and time is not enough.\n  - motivation weakening.\n- Working on consistency is unpleasant and seem impossible.\n\n- UI and OS Approach to habit tracking / journaling.\n  - intentionally repurpose your psychology to work like a dashboard.\n  - OS: your mind. complex and overwhelming.\n  - UI: Like an app. a view into the mind specific to certain thing you want to acheive.\n\n- Engaging in the things you want to improve / make habit of feels great, but the catch is you feel great _after_ the habit sticks to you.\n  - Fin a way to run those _apps(habit tracking)_ whenever your _OS(mind)_ goes into crisis.\n\n- achieveing lasting changes:\n  - Awareness of the changes one desires to make.\n  - Identifying problems and solutions.\n  - Commitment to making the change.\n\nMethod\n- Every morning draw a square. Each square is a day. At the end of the day you fill in the square with info.\n- Remind yourself that every day is unique and will never happen again.\n- Reassure yourself that even if I fail you will have another square for tomorrow.\n- On the center of the square, record what you want to remember from that day. (wins. gratitude.)\n- Mark on parts of the square what you want to track. This could be anything. Make it visual and appealing.\n- Go over the squares periodically and retrospect.\n","n":0.061}}},{"i":19,"$":{"0":{"v":"Lowering Your Blood Pressure with Dash","n":0.408},"1":{"v":"\nSource: https://www.nhlbi.nih.gov/files/docs/public/heart/dash_brief.pdf\n\n- Research shows that DASH can prevent / lower high BP.\n- high BP: higher than 140/90 mmHg.\n- prehypertension: between 120/80 mmHg and 139/89 mmHg.\n\n- Take these steps to prevent high BP\n  - Follow a healthy eating plan.\n  - Maintain a health weight.\n  - Be moderately physically active for at least 2.5 hours per week.\n  - If you drink, do it in moderation.\n\n- DASH\n  - rich in fruits, vegetables, fat-free or low-fat diary, whole grains, fish, poultry, beans, seeds and nuts.\n  - less sodium and sweets.\n  - lower saturated fat, trans fat and cholesterol.\n  - rich in nutrients that are associated with lowering bp\n    - potassium, magnesium, calcium, protein, and fiber.\n\n- DASH requires no special food / recipe.\n- Simply add certain number of servings from food groups.\n- _How much_ you eat depends on your calorie requirements.\n- Sodium: aim for 2300 mg first and then try switching to 1500mg gradually.\n  - Creative ways to lower sodium intake\n    - use herbs, spices, lemon/lime, vinegar, wine in cooking.\n\n- Make changes over a couple of days/weeks\n  - Add servings of vegetables on each meal gradually.\n  - Increase the use of fat-free / low-fat dairy.\n  - Limit lean meats to 6 ounces a day / 3 ounces a meal.\n  - Include two or more vegetarian-style / meatless meals each week.\n","n":0.068}}},{"i":20,"$":{"0":{"v":"How to Take Smart Notes","n":0.447},"1":{"v":"\n**How to Take Smart Notes: One Simple Technique to Boost Writing, Learning and Thinking - for Students, Academics and Nonfiction Book Writers**\n\n","n":0.213}}},{"i":21,"$":{"0":{"v":"Dogfood","n":1},"1":{"v":"\nsource: https://www.joelonsoftware.com/2004/04/16/news-3/\n\n- **eating your own dogfood** means being a user of your own code. being both the user and the developer.\n  - user empathy comes automatically.\n\nsource: https://en.wikipedia.org/wiki/Eating_your_own_dog_food\n\n- The practice of using your own prodicts or services.\n- act of quality control\n- a kind of testimonial advertising.\n- can demonstrate develops confidence in their own product.\n- The practice enables proactive resolution of potential inconsistency and dependency issues, especially when several developers or teams work on the same product.\n- origin of term\n  - https://www.computer.org/csdl/magazine/so/2006/03/s3005/13rRUygBwg0\n\n- criticism\n  - The people who make the product (developers) may not be the best people to understand the end users.\n\nsource: https://instabug.com/blog/the-risks-of-dogfooding-and-when-not-to-dogfood/\n\n- It's not just about testing your app.\n- It's about _putting yourself in your users' shoes and see things from their perspective._\n  - Something that needs to be embedded in your culture to unlock it's potential.\n  - Using your app in a real-world environment for the same purpose and in the same way your end-users would.\n- You need to define your target audience.\n  - and close you are with them.\n  - you need to make sure that the feedback you get from dogfooding is in line with what the users are thinking.\n    - otherwise you are risking building a tool that fits your team, but not the end users.\n- Your team is a lot more familiar with your app than your customers are.\n  - You need a fresh set of eyes to view your product in this case.\n- it is natural for your team to be biased towards the app\n- dogfooding is great but it's not a replacement for proper QA testing.\n- if your app does a very specific / specialized task and cannot be adapted to you, it is best to avoid dogfooding as it will likely give a false feedback.\n- doing it too early when the product is immature may backfire as well. In this case dogfooding could be more of an obstacle.\n\nsource: https://www.computer.org/csdl/magazine/so/2006/03/s3005/13rRUygBwg0\n- Lorne Greene was a pitchman for Alpo dog food and showed a commercial that he fed Alpo to his dogs.\n- The president of Kal Kan Pet Food would eat a can of the company's dog food at the annual shareholder's meeting.\n- At some point \"dog food\" became a verb.\n- The software industry has adopted the phrase to mean that they use their own products.\n\n- evidence that the company has confidence in its own software.\n  - pitfalls:\n    - they are getting it for free.\n    - ultimately, the people who select what software gets used are more likely to be the ones paying for it than the ones using it.\n- finding bugs through dogfooding\n  - makes you wonder how confident the company is in its testing and QA process.\n    - may actually reduce confidence in testing.\n- companies using only their product may not be able to realize alternative approaches exists.\n  - failing to appreciate and respect good features of other companie's tools.\n- peer pressure to use your teams product\n  - arrogance/cluelessness of competitors can grow in your team\n  - could lead to Hapsburg jaw (https://en.wikipedia.org/wiki/Prognathism)\n- `Not Invented Here` syndrome.\n  - scarce resources might get allocated to building tools taht could easily be purchased from others.\n","n":0.044}}},{"i":22,"$":{"0":{"v":"Digital Zettelkasten","n":0.707},"1":{"v":"\n**Digital ZettelKasten: Principles, Methods, and Examples**\n\n## Notes\n- The purpose of Zettelkasten is to explore the connection between notes. \n- Zettelkasten helps you ship writings.\n    - It helps you to:\n        1. retain what you read\n        1. retrieve it quickly\n        1. know what to read next\n        1. develop your ideas\n    - But ultimately the goal is to produce a piece of writing at the end.\n- You can still read for pleasure without writing notes. Don't think you need to write notes and highlight things for every piece of article or books you read.\n    - Only do it for things you do want to retain and use for your purpose later.\n- It's not useless to write things down word-for-word if you want is exactly that: to refer to the exact text later.\n- Otherwise, it is better to process that into your own words.\n    - re-writing it involves actively thinking about it, and this fires a different part of your brain.\n    - it leverages your brain's power to associate a piece of knowledge with other existing ideas.\n- Using Google to substitue your memory and using a Zettelkasten is different.\n    - The association does not happen in your brain.\n- Using a a pen and paper could have benefits.\n    - Research shows that writing by hand improves retention.\n- In fleeting notes, you need to record enough of the context so that when you access it later to turn that into a literature note, you can recall what you were thinking when you were reading it.\n- Choosing the right keyword allows you to explore your Zettelkasten effectively.\n- Archivist's mind and writer's mind pick keywords differently\n    - archivist: how do I choose a keyword so that I can retrieve this easily without second guessing?\n    - writers: how do I choose a keyword so that it's useful in writing later?\n- Try choosing keywords that are _specific to an idea_.\n- Links or tags? They serve similar purposes.\n- highlighting the highlights -> \"progressive summarization\" (Tiago Forte)\n","n":0.055}}},{"i":23,"$":{"0":{"v":"Deep Work","n":0.707},"1":{"v":"\n# Deep Work\n\n## Rules\n\n[[Work Deeply|ext.deep-work.rule-1]]\n- You need deliberate strategies to internalize deep work into your system.\n\n[[Embrace Boredom|ext.deep-work.rule-2]]\n- Distraction is the worst enemy when it comes to deep work, and you need to take deliberate actions to minimize the time being distracted.\n\n[[Quit Social Media|ext.deep-work.rule-3]]\n- Social media and other tools may not be as useful as you might think.\n- Consider cutting them out of your life.\n\n[[Drain the Shallow|ext.deep-work.rule-4]]\n- Spending more time in a deep work state is the ultimate goal, but we cannot eliminate shallow work in this modern society.\n- Take measures to minimize the time you spend on shallow work by cutting down unimportant ones.\n","n":0.098}}},{"i":24,"$":{"0":{"v":"Rule 4","n":0.707},"1":{"v":"\n# Rule #4\n\n_**Drain the Shallows**_\n- Reduction of workweek at Basecamp eliminated shallow works but did not effect deep work.\n- People had to make sure things get done in time so they opted to spend their time more doing deep work.\n- This resulted in reducing low-impact shallow work but didn't cause any problems with the core important work being done.\n\n- Removing shallow work completely is not possible. You need some of them to function properly in modern society.\n  - Don't try to eliminate it. But do try to tame it.\n  - You can only do deep work within your cognitive capacity. If you push, you will get exhausted.\n  - This means when given 8 hours to work a day, if you have a capacity to work in a deep state for 4 hours, you are safe to spend time on shallow work for the rest of the 4 hours.\n\n## Schedule Every Minute of Your Day\n- We spend a lot of our time on autopilot, not giving much thought to what we do.\n\n- Schedule every minute of your day, with 30 minute blocks.\n- You will quickly find that your estimations will be wrong.\n- Reschedule if you are falling behind.\n\n- The goal is _not_ to stick to a schedule religiously.\n  - You are most likely going to deviate from your schedule.\n  - The goal is to be mindful of the what you are going to do moving forward even if you have to re-do the scheduling every time you finish a block.\n\n- Sometimes deep work will spark you with an important insight and will override all the schedules you have made for that day, and this is okay. It is an exception worth making.\n  - This is allowing spontaneity in your schedule.\n  - Again, scheduling is not about constraining yourself, but is to be thoughtful of what you are going to do moving forward.\n    - _treating your time with respect_.\n\n## Quantify the Depth of Every Activity.\n- You can't eliminate shallow work, but you do have to evaluate how shallow some works are, so that you can prioritize.\n- Ask yourself, how many months will it take for a fresh college grad to learn to do this task successfully?\n  - If the number is high, prioritize it higher.\n","n":0.052}}},{"i":25,"$":{"0":{"v":"Rule 3","n":0.707},"1":{"v":"\n# Rule #3\n\n_**Quit Social Media**_\n\n- Your willpower is limited.\n- Social media feeds your short-circuited brain instant gratification.\n- You have less time and energy for deep work.\n- These tools are not inherently evil.\n  - If you can find value in it, feel free to use them.\n  - But don't operate under the _any-benefit_ mindset.\n\n## The _Any-benefit mindset_.\n- Justifying the use of social media if you can identify _any_ possible benefit from it.\n- This ignores the negatives that come with social media.\n\n- Throughout history, skilled laborers have meticulously thought about choosing the right tools for them, and knowledge workers should do the same.\n\n## The _Craftsman Approach_ to tool selection.\n- Identify the core factors that determine success.\n- Adopt the tool if it increase the likelihood of said success, even after factoring in the negatives that come along with it.\n\n## Apply the Law of the Vital Few to Your Internet Habits\n- 80% of a given effect is due to just 20% of the possible causes.\n- a.k.a the Pareto principle, 80/20 rule, principle of factor sparsity.\n- If you spend time on the low-impact activities, you are taking away time that could otherwise be spent on high-impact activities.\n\n## Quit Social Media\n- You are not really missing out.\n- People don't actually _want to hear what you have to say_.\n  - Social media is designed to give you an easy way to signal your opinion to others.\n    - _You \"like\" my status update and I'll \"like\" yours. This agreement gives everyone a simulacrum of importance without requiring much effort in return.\n\n## Don't use the Internet to Entertain Yourself\n- Outside of the 8 hour workday, you have 16 hours all to yourself.\n- Treat them like a day within a day, not a prologue or epilogue to your \"work day\".\n- Deliberately making use of your day outside the time you work.\n- Put more thought into your leisure time.\n  - Don't default to what grabs your attention at the moment.\n  - Spend some time thinking what you can do with your time instead.\n- Some may say adding structure to your leisure time will make you more tired for the next work day, but this is not the case.\n  - It will _increase_ the value instead.\n  - What your mind needs is _change_ not _rest_. They don't get tired like your limbs.\n    - Except until you do need to rest (e.g. attention fatigue, etc.), which is why we sleep.\n- If you give your mind something meaningful, your day will be more fulfilled and be ready to start a new one the next day.\n","n":0.049}}},{"i":26,"$":{"0":{"v":"Rule 2","n":0.707},"1":{"v":"\n# Rule #2\n\n_**Embrace Boredom**_\n\n- The ability to concentrate is something you need to train.\n  - It's not something you know is good but you are simply neglecting. You need to build the mental muscle to properly concentrate.\n  - You also need to wean off the distractions around your life at the same time.\n  - Clifford Nass\n    - _People who multitask all the time can't filter out irrelevancy. They can't manage a working memory. They're chronically distracted._\n- If every moment of boredom is relieved with a dose of quick and immediate gratification (e.g. distractions like social media), your mind will be wired to seek those even in times where you need to get in to deep work state.\n\n## Strategies\n\n### Don't Take Breaks from Distraction. Instead Take Breaks from Focus.\n- Once you are wired to seek distraction, you will crave it.\n  - Some people go on Internet Sabbaths (digital detoxes) to _take a break from distraction_.\n- Instead of doing this, turn it around and _schedule breaks from focus_, where you are allowed to be distracted.\n  - Segregate blocks of times you are allowed to use the Internet.\n  - You are strengthening the muscle that seeks focus instead of the ones that seek distraction by doing so.\n\n1. This strategy works even in your job requires lots of Internet use and/or prompt e-mail replies.\n    - If your work _needs_ the internet, you simply allocate blocks more frequently.\n    - The number or duration of blocks don't matter as long as you keep the integrity of _off time_ in tact.\n1. Regardless of how you schedule your Internet blocks, you must keep the time outside these blocks absolutely free from Internet use.\n    - What if you forgot to pull in everything you need from the internet while you are in an offline block?\n      - Immediately rescheduling and going back to the internet is not the way.\n      - Try to find another offline activity that needs your focus.\n      - If that doesn't work, try to resist going back to the internet to get what you need because the point of doing this is to condition your mental muscle to seek focus. Resistance will build that muscle for you.\n1. Scheduling Internet use at home as well as at work can further improve your concentration training.\n    - Train yourself to resist getting sucked into distractions even after work to further strengthen your mental muscle to seek focus.\n    - Embracing the boredom while waiting in line, etc. is valuable.\n      - Again conditioning yourself to not immediately reach for the quick release of dopamine.\n\n\n### Work Like Teddy Roosevelt\n1. Identify a deep task.\n1. Put it high on your priority.\n1. Estimate how long you would normally give this task.\n1. Give yourself a hard deadline that will significantly reduce the time you would normally allocate to it.\n1. Work with great intensely to fit that task within the deadline.\n  - a.k.a the _Roosevelt Dashes_\n\n- This is great because this method is incompatible with distraction.\n  - You can't afford to be distracted in this situation.\n\n### Meditate Productively\n- Productive meditation\n  - Take a period of time where you would be occupied in a physically but not mentally draining task.\n  - Focus your attention to a single well-defined problem you are trying to solve during this time.\n- This has a benefit of naturally resisting distraction in period of time where your brain will otherwise be idle (because your task is only phsycially demanding).\n\n1. Be Wary of Distractions and Looping\n    - When you find yourself drifting away from your problem, remind yourself gently and get back to it.\n    - Looping\n      - When faced with a complex problem you may get stuck spending energy thinking about what you already know about.\n      - Make note that you are in a loop, and think of the next steps to take in order to get out of that loop.\n1. Structure Your Deep Thinking\n    - Carefully think about the variables involved in solving this problem.\n    - Once you have them in your mind, figure out the next step to take after consolidating your findings.\n\n### Memorize a Deck of Cards\n- Memorizing requires immense focus.\n- It's not about memorizing for the sake of memorizing something.\n  - It is about focusing on something intensely to grow your muscles for concentration.\n- There is nothing special about memorizing a deck of cards. If that doesn't make sense, find something else that needs intense focus.\n  - e.g.) Studying the Talmud. Trying to learn guitar by ear.\n- Your ability to concentrate is only as strong as your commitment to train it.\n","n":0.037}}},{"i":27,"$":{"0":{"v":"Rule 1","n":0.707},"1":{"v":"\n# Rule #1\n\n_**Work Deeply**_\n\n## Eudaimonia Machine\n- A state in which you're achieving your full human potential.\n- A space designed to enable the deepest possible deep work.\n- A work environment (and culture) designed to help us extract as much value as possible from our work.\n- This is an _ideal_. We can't have this in the modern world.\n- But we can try to emulate this by removing the things that are in our way.\n\n## Simply reminding yourself to concentrate more isn't enough for deep work.\n- You are constantly challenged with desire to do anything BUT work.\n- _You have a finite amount of willpower that becomes depleted as you use it_. ^Y0Ql_XBV\n- You have to add _routines_ and _rituals_ on top of your good intentions to minimize these obstacles that block you from acheiving deep work.\n\n## Strategies\n\n### Decide on Your Depth Philosophy\n- You need your own way of integrating deep work into your life.\n- There is no right answer to this, but it is worth exploring what is right for _you_, as a incompatible depth philosophy may be of harm.\n- Deploying deep work in an ad-hoc way is also not an effective way.\n\n1. The Monastic ^Fop4AVPo\n    - Maximize deep efforts by eliminating shallow obligations.\n      - No emails, no phone calls, etc...\n    - Completely going dark to focus on deep work.\n    - Not so compatible with most people in a modern world.\n1. The Bimodal ^2zHHwu66\n    - Divide and allocate a clearly defined stretch of time to deep work, and go back to normalcy when it's over.\n    - Works only if you dedicate enough time to reach peak cognitive intensity.\n      - Tends to be no shorter than a day.\n    - For people who cannot simply be absent from their normal life to focus on their interests.\n1. The Rhythmic ^Gqkgruf8\n    - The _chain method_.\n      - Easiest way to start deep work is to make it in to a regular habit.\n      - Create a rhythm for this work and remove the _need to decide when_ it is best to switch to deep work.\n    - By not spending energy to even think about when to go into deep work, you are removing a barrier to it.\n    - In contrast to bimodal or monastic approach, this will likely not let you allocate enough time to reach your peak cognitive intensity, but it respects the reality of human nature.\n      - In the long run, rhythmic workers will log more hours of deep work than bimodals.\n    - A matter of self control. If nothing is pressuring you to do deep work (your life doesn't immediately depend on it), making it a habit is better.\n    - In reality, your situation might not allow for long periods of deep work. In this case, you are locked into trying to make it a habit.\n1. The Journalistic ^tdNLbh_j\n    - Fitting deep work whenever you can in your schedule.\n    - There will be a lot of context switching which can quickly deplete your willpower.\n    - This assumes a certain level of confidence in your ability to focus.\n    - Do it if you can pull it off. It won't be easy.\n\n### Ritualize\n- People who achieve great results with their minds don't work in an ad-hoc fashion.\n- To make the most out of deep work, set up rituals like the important thinkers.\n  - Mason Currey\n    - _There is a popular notion that artists work from inspiration--that there is some strike or bolt or bubbling up of creative mojo from who knows where... but I hope my work makes clear that waiting for inspiration to strike is a terrible, terrible plan. In fact, perhaps the single best piece of advice I can offer to anyone trying to do creative work is to ignore inspiration._\n  - David Brooks\n    - _Great creative minds think like artists but work like accountants_ ^2bdoDu3q\n- Rituals minimize friction in the transition from shallow to deep work, and it allows you to stay in deep work state longer and easier.\n\n- Some questions to ask yourself:\n1. Where you'll work and for how long.\n    - Specify where you want to get into deep work, and set a timeframe so that you don't have to worry about it every time.\n1. How you'll work once you start to work.\n    - Lay out what you should and should not be doing in every session, so that you don't have to mentally go over it again and again.\n    - Failing to do so will cause you to drain your precious mental resources in deciding those things.\n1. How you'll support your work.\n    - Figure out what you need / what state you need to be in during your deep work sessions beforehand so that you don't have to interrupt it to get them.\n    - e.g.)\n      - A cup of coffee.\n      - Being sufficiently fed.\n      - Exercise.\n      - Body is clean, Desk is clean, had a good sleep.\n\n### Make Grand Gestures\n- A radical change from your everyday environment will give you a hightened perceived importance of the task you want to focus on.\n  - J.K. Rowling finished her last book at a Luxury hotel.\n    - Significant investment, new environment.\n  - Bill Gates had a log cabin where he would retreat to in weekends to think about important decisions.\n    - The novelty of the idea of going to a secluded location to think gave his tasks more perceived importance.\n  - Michael Pollan built a cabin at their property to be used for deep work.\n    - It's not the amenities of the log cabin that enabled deep work. It's the special treatment and delibrate effort that gave more importance to the task which led to a deeper concentration.\n- Not all grand gestures need to be permanent.\n  - Peter Shankman booked a round-trip business-class ticket to Tokyo, wrote the entire time he was on the plane, grabbed an espresso in Tokyo, and hopped back on the plane. Wrote the entire time he was on the way back. Finished writing.\n- It is about committing to the task at hand seriously.\n\n### Don't Work Alone\n- Leveraging collaboration in deep work is tricky but is worth exploring.\n- Hub and Spoke architecture.\n  - Hub: A place to expose yourself regularly, that encourages serendipitous encounters with others.\n  - Spoke: A place you can retreat from the encounters and focus on your task at hand.\n  - Even in a spoke, some tasks may be more fit to be collaborated than in isolation.\n    - The whiteboard effect: back-and-forth effort between collaborators focusing on a specific idea or task.\n- Don't push the idea of collaboration to a point where it becomes more of a distraction.\n\n### Execute Like a Business\n- Division between _what_ and _how_ is overlooked.\n- _Strategizing_ is easier than _executing_.\n- Adapt and follow _The 4 Disciplines of Execution_ (4DX) to deep work.\n\n1. _Focus on the Wildly Important_\n    - _The more you try to do, the less you actually accomplish._\n    - Execution should be aiming for a small number of ambitious outcomes during your deep work sessions.\n1. _Act on the Lead Measures_\n    - You need to measure your success.\n      - Lag measure\n        - The thing you are trying to improve.\n        - You can only measure this after the fact.\n        - e.g.)\n          - Write 10 books this year.\n      - Lead measure\n        - Measures the new behaviour that will drive success on lag measures.\n        - Immediately measurable.\n        - e.g.)\n          - Did 4 hours of deep work today.\n    - Focus on lead measures.\n    - In the context of deep work, the lead measure is the time spent in a state of deep work dedicated toward _your wildly important goal_.\n1. _Keep a Compelling Scoreboard_\n    - You should have a physical artifact in your workspace that shows you the count of your lead measure.\n1. _Create a Cadence of Accountability_\n    - Adopt a regular retrospection on your lead measure on deep work to ensure you are on the right track.\n\n### Be Lazy\n- _Idleness is not just a vacation, an indulgence or a vice; it is as indispensable to the brain as vitamin D is to the body, and deprived of it we suffer a mental affliction as disfiguring as rickets... it is, paradoxically, necessaryy to getting any work done._\n- Incorporate regular and sufficient _free time_ into your life, between deep work sessions so that you can be idle. This will give your brain room to perform better when it needs to (during deep work).\n- At the end of your workday, shut down. Once you shut down, your mind must stay free of concern of your work.\n- Have a strict shut down ritual. ^HnqIEqCAMwE8MZ92\n  - Ensure that all incomplete tasks / goals have been reviewed and you have plans to finish them / continue working on them when you get back.\n  - Have something that demarcates the shutdown.\n    - e.g.)\n      - Vocally tell yourself \"shutdown complete\".\n      - This gives you a simple cue to shut down.\n- Zeigarnik effect\n  - _Incomplete tasks dominate our attention._\n  - however you don't need to _complete_ your tasks to take it off your mind.\n    - Just make note of how you will go about completing those tasks later, and your mind can rest.\n    - Commiting to a specific plan to finish your task facilitates actually finishing that task later, and also frees your cognitive resources for other pursuits.\n  - If you do not do a proper shutdown, the incomplete tasks will bog you down and not let your mind rest for tomorrow.\n    - and you will _always_ have incomplete tasks.\n- Shutting down is important because:\n  1. _Downtime Aids Insight_\n      - Some decisions are better left to your unconscious mind to untangle.\n      - The _unconscious thought theory_\n        - for decisions that require the application of strict rules, conscious mind must be involved.\n        - however, for decisous that involve a lot of vague or even conflicting information and constraints, your unconscious mind is better.\n      - Letting your conscious brain rest means giving control to your unconscious mind, and is thus not reducing the time spent on solving problems. It is just a different mode of working.\n  1. _Downtime Helps Recharge the Energy Needed to Work Deeply_\n      - _Attention restoration theory_\n        - You get attention fatigue.\n        - To concentrate, you require _directed attention_.\n      - Introducing inherently fascinating stimuli lets your brain replenish the energy for directed attention.\n      - Go for a walk, cook a nice dinner, listen to music, etc. Anything that will make you let go of that attention.\n  1. _The Work That Evening Downtime Replaces Is Usually Not That Important_\n      - The amount of deep work you can put in a day is limited.\n      - Beyond a certain point, you are effectively not in deep work state.\n      - Anything you do after that is done in a shallow state, and is not worth sacrificing your rest time.\n        - They don't matter enough.\n","n":0.024}}},{"i":28,"$":{"0":{"v":"Art and Fear","n":0.577},"1":{"v":"\n> ... art is rarely made by Mozart-like people - essentially (statistically speaking) there aren't any people like that. But while geniuses may get made once-a-century or so, good art gets made all the time. ... \n\n## Index\n- [[The Nature of the Problem|ext.art-and-fear.chapter-1]]\n- [[Art and Fear|ext.art-and-fear.chapter-2]]\n- [[Fears About Yourself|ext.art-and-fear.chapter-3]]\n- [[Fears About Others|ext.art-and-fear.chapter-4]]\n- [[Finding Your Work|ext.art-and-fear.chapter-5]]\n","n":0.135}}},{"i":29,"$":{"0":{"v":"Chapter 5","n":0.707},"1":{"v":"\n## Finding Your Work\n- Art is exquisitely responsive.\n- In art, it is more nourishing to be a maker than a viewer.\n- Decisive works of art participate directly in the fabric of history surrounding their maker.\n  - You can't learn much about making that particular piece by being moved by it, as the creation is bound to the moment and location of where it happened.\n- If for any given time only a certain sort of work resonates with life, that is what you should be doing in that moment.\n- This is especially true now that art has been divorced from being a community effort and more close to the artist themselves.\n\n### Canon\n- It is extremely common to encounter work not unfolding.\n- You may think that:\n  - you've run out of new ideas, or\n  - you've been following a wrong path that leads to a dead end.\n- But if it was working before and it isn't now, neither could be the case.\n- New ideas come into play far less frequently than practical ideas.\n- What you did got you here, and if you apply the method again, you will get to the same place.\n  - If something was working and now it's not, your method has changed somewhere.\n\n- Certain tools make certain results possible.\n  - The dilemma: \n    - When to stick with familiar tools and materials\n    - When to reach out and embrace new things.\n- We don't think about how or why we do things the way we do it. We just do.\n  - Especially when things are going well.\n\n- Working within the self-imposed discipline of a particular form eases the prospect of having to reinvent yourself with each new piece. ^n0zxPU5gvZMM\n- Once you discover a useful form of work, it should not be abandoned.\n- Making good art depends on making _lots_ of art, and anything that lets you do put the first brushstroke onto the canvas has a very real, tangible and practical value.\n  - Only the maker has a chance of knowing how important these minutiae and rituals are to them to stay at work.\n  - These can be uninteresting to the viewers.\n- The hard part is finding these patterns.\n- Over time, a productive artist will have amassed these small patterns that makes them keep churning out work.\n  - As time goes by, these patterns go beyond simple procedure and gives the artist's work their own color.\n    - It becomes inseparable from the artist.\n    - At this point, the particularity of individual work becomes less of an issue.\n","n":0.049}}},{"i":30,"$":{"0":{"v":"Chapter 4","n":0.707},"1":{"v":"\n## Fears About Others\n- Other people's reaction to your art doesn't need to cause problems for you but they do anyways.\n  - We often confuse priorities of others and priorities of our own.\n- As a society, we are expecting artists to produce a personally imtimate and also generally alluring artwork.\n- When things go well we keep it to ourselves, but when it isn't we seek for external validation.\n- It is hard to not take criticism of your work when art is very much personal.\n\n### Understanding\n- Wanting to be understood is a basic need.\n- By presenting your art to the world, you are handing out the power of disapproval to others.\n  - That may be true. Artists aren't generally someone who are viewed as a model of normalcy.\n- What may be needed is some time for an artwork to achieve a state of understanding by the artist themselves. With that in place, external understanding or the lack thereof will be less of a problem to the artist.\n- Catering to the fear of misunderstanding and not following what you truly believe will limit your artwork to be something that can easily be understood by the audience.\n  - By doing this you risk being arrogant and condescending.\n\n### Acceptance\n- _Will my work be counted as art?_\n- This leads to fear of your work percieved as craft, hobby, or decoration. (not art).\n  - Even worse, nothing at all.\n- At some point this fear will collide with doing work that is true to you.\n- The world generally _does_ reward authentic work, but the problem is that there is a temporal aspect to it; you may not be around to get the reward when it happens.\n  - The world will generally try to understand work that already has been understood for a long time.\n- Risk not being understood by exploring new territories? \n- or take the proven path to be immediately understood?\n  - This may be necessary, beneficial, and inevitable.\n  - Everyone does have some period of recapitualtion.\n  - The danger here is that you may be stuck there forever and not teach the future you anything new.\n- A better question is _will your work be counted as **your** art?_\n\n### Approval\n- _Acceptance_ and _approval_ becomes linked and indistinguishable, but they are subtly different.\n  - Acceptance: will it be counted as art?\n  - Approval: will people like it?\n- For artists, surviving means finding an environment where art is valued and encouraged.\n- These are _audience_ related issues.\n  - Audience comes later.\n  - The only pure communication is between you and your work.\n","n":0.049}}},{"i":31,"$":{"0":{"v":"Chapter 3","n":0.707},"1":{"v":"\n## Fears About Yourself\n- _When you act out of fear, your fears come true._\n- Two types of fear:\n  - Fear about yourself\n    - Prevents you from doing your best\n  - Fear about the reception of your work by others.\n    - Prevents you from doing you own work.\n\n### Pretending\n- Fear that you are just pretending to do art.\n- Comes from doubting your credentials as an artist.\n- Sometimes you will hit a wall and work becomes slow. Here, if you believe that art can only be made by extraordinary people, this wall will confirm that you are not.\n- Art (both making and viewing) takes a lot of energy, and the _art is for extraordinary people_ mindset gives you an excuse to quit.\n- You may sometimes feel like you are pretending to be an artist, but this is impossible. ^rMDCTFEKrQzE\n  - Your work not being recieved well or not being exhibited somewhere does not make you a pretender. This is a completely different issue.\n- Someone has to do an artist's work, and you are doing it.\n\n### Talent\n- Talent is about _what comes easily_, and you will reach a point where things don't come easily.\n- Pondering about how much talent you have is the most wasteful thing you could do in art. It is also the most common sentiment artists have.\n- Talent _may_ give someone a head start, but without direction or goal it is meaningless.\n- Those who rely on talent will peak quickly and fade quicker.\n\n- Mozart improved his work by working.\n- Artist get better by improving their skills / learning new ones\n  - by working.\n  - by learning new things from their past work.\n\n- Why does it not come easily then?\n  - Because art is hard.\n\n- Practical questions about talent\n  - Who cares? Nobody.\n  - Who would know? Nobody.\n  - What difference will it make? None.\n\n### Perfection\n- Art is human, error is human, _ergo_, art is error.\n- Your art will inevitably be flawed.\n- If art needs to be perfect, no existing work would qualify as art.\n- To require perfection is to invite paralysis.\n- Demanding perfection is to deny humanity.\n- The seed of you next work lies within the imperfections of your current piece. ^63VoyHdA8jil\n  - These are your guides that are valuable and reliable.\n  - These give meaning to the art you are making.\n\n### Annihilation\n- Some equate themselves with their art too much that they equate not making art with not being.\n- This is a common but mostly overdrawn existential fear that some part of you dies when you stop making art.\n- It is true, and the risk of not doing work depends on your need and desire to make stuff.\n\n### Magic\n- _Maybe making art requires something special, something magical, that I don't have?_ ^sgrp0vGhGXdk\n- This belief gives you the need to prove that your work does have some magic to it.\n- With this mindset, when the work does turn out good, you are inclined to believe it's a fluke. If it doesn't, it's an omen.\n- There might be something special needed in order to make art, but it isn't a universal one. It will be personal to each individual artist.\n  - But it doesn't matter.\n  - Point is, whatever that person has, even if you had it, it wouldn't help. If _you_ had some kind of magic, it will help, but you probably don't need it.\n\n### Expectations\n- Balance between imagination and calculation.\n  - Too much imagination: you are filled with fantasies\n  - Too much calculation: you spend your life generating to-do lists.\n- Expectations can very easily drift into imagination.\n  - Almost always leads to disillusionment.\n- Expectations based on the work itself is the most useful to the artist.\n  - What do you need to do on your next piece? The last piece has the information.\n  - Your work is your guide and reference.\n- So you need to look at your work without judegment / need or fear / hopes / expectations.\n- It is about asking what your work needs, not what _you_ need. ^Jm3ntoEebkD0\n","n":0.039}}},{"i":32,"$":{"0":{"v":"Chapter 2","n":0.707},"1":{"v":"\n## Art and Fear\n\n- Those who continue to make art are the ones who learned _how to not quit_.\n  - Artists quit when \n    - they convince themselves that their next effort will fail them.\n    - they lose where their work belongs / lose their destination.\n- _the pen has run dry_ / artist's block / etc.\n  - It means it's time to cultivate new ideas, but in artistic death, it means it's the last thing an artist will do.\n- Quitting means not starting again, but art is all about starting again. ^QgLc00UDcxI2\n\n- Another case: reaching their destination.\n  - Success turns into depression.\n  - Don't let you current goal become your only goal.\n    - Always leave next steps and think about your next destination.\n\n- _OPERATING MANUAL FOR NOT QUITTING_\n  - Make friends with others who make art, and share your in-progress work with each other frequently. ^beDUjUvSguJQ\n  - Think of the above as the destination of your work, not MoMA.\n\n- The fear that naturally comes to people who get the sense of self from making art\n  - I am not up to the task, I can't do it / do it well, can't do it again, I have no talent, I am not a good artist, I have nothing to say.\n\n- These fear has less to do with art itself, it's more about the artist. Even less with each art piece.\n- What separates artists from ex-artists is that those who challenge their fears continue, and those who don't, quit.\n\n### Vision and Execution\n- Vision is always ahead of execution (it should).\n- Knowledge of materials is your contact with reality.\n- Uncertainty is a virtue.\n  - When you see that self-doubt is a simple observation of reality, uncertainty becomes an asset.\n\n### Imagination\n- The artwork's potential is highest on the first brushstroke, and will naturally diminish. Imagination becomes less useful as the skill / craft takes over.\n\n- The development of an imagined piece into an actual piece is a progression of decreasing possibilities.\n  - Each step reduces the future options.\n  - When the piece could not be other than it is, it is done.\n\n- The moment of completion is the moment of loss\n  - of all other forms of that piece that could have been.\n\n- The artist's life is frustrating not because the passage is slow, but because they imagine it to be fast.\n\n### Materials\n- Without you as an artist participating in turning the potential into reality, the material will stay there indifferently. They will do precisely what you make them to do.\n\n- _The painter who stands before an empty canvas must think in terms of paint_.\n- Knowledge of how the material responses and resists will suggest new ideas to you.\n- Art is about carrying things out, and the material is what _can_ be carried out.\n\n### Uncertainty\n- Other than the material you are using, most if not all other aspects of art is filled with uncertainty.\n- You need to give yourself room to respond to this uncertainty authentically.\n  - Art happens between _you_ and _something_, and both need to be free to move around.\n- Art is risky, subversive, complicated, etc.\n  - People who need certainty are less likely to make art.\n- What an artist needs\n  - general sense of what they are looking for\n  - a strategy to find it\n  - and willing to accept the mistakes and surprises along the way.\n- Tolerance to uncertainty is needed.\n","n":0.042}}},{"i":33,"$":{"0":{"v":"Chapter 1","n":0.707},"1":{"v":"\n## The Nature of the Problem\n\n- Nowadays, making art means facing uncertainties and doubts. ^KyVEyFcV2lyU\n  - Doing something nobody might care whether you do, doing something that you might not get rewarded for.\n  - Making art means despite these hurdles you find meaning within the work itself. ^GBvJ5I9iGGqU\n\n- fatalism: the fear that your fate is in your hands, but your hands are weak.\n\n- Assumptions\n1. Artmaking involves skills that can be learned. ^AcUEhhFXDSys\n    - It's not a magical gift.\n    - Being an artist means:\n      - learning to accept yourself (makes your art personal)\n      - follow your own voice (makes your art distinctive)\n    - These qualities are clearly something that can be learned.\n2. Art is made by ordinary people. ^vc0OUGjsSfn4\n    - A flawless creature does not need to make art.\n    - In turn, this means an ideal artist would be an ordinary person with all the flaws and weaknesses.\n    - These are things that get in the way of making art, but it is what drives us to make art.\n    - Making art has to do with overcoming these.\n3. Making art and viewing art are different at their core. ^YHpWMDrfGp2U\n    - Making art gives you an accurate measure of what you intended to do and what you actually did.\n    - To everyone else, what matters is the end product. To yourself, and you alone, the process is what matters.\n      - Artmaking can be lonely and thankless.\n    - There is no good reason anyone else _should_ care about any art other people make.\n      - You learn _how to make your work_ by _making your work_.\n      - learning to make your own work is not anyone else's problem.\n4. Artmaking has been around longer than the art establishment. ^MpBMOMvu6nPo\n    - People have been making art long before the concept of self, consciousness has entered humanity.\n    - The notion of art being a _self-expression_ is a rather contemporary concept.\n      - If you make flawed art, does that make you a flawed person?\n      - If you make no art at all, are you not a person at all?\n    - It is best to not get into the trap of this and think that art has many paths.\n","n":0.053}}},{"i":34,"$":{"0":{"v":"A Complete Guide to Tagging for Personal Knowledge Management","n":0.333},"1":{"v":"\nSource: https://fortelabs.co/blog/a-complete-guide-to-tagging-for-personal-knowledge-management/\n\n- Author has criticized harshly about tagging [[in this article|ext.tagging-is-broken]]\n- Author has changed their mind since.\n\n- There are two kinds of structure: hierarchies and networks.\n    - It is easy to think that in a \"network age\" that hierarchies are a thing of a past and is too restrictive.\n    - However this is not the case and history tells you otherwise.\n        - Both have existed for a long time and has had tension and balance between them.\n        \n- Hierarchies\n    - System of nested groups.\n    - inherently top-down.\n\n- Network\n    - has no correct orientation.\n    - Each node is autonomous.\n    - there are only relationships between the nodes.\n\n- Hierarchies and network are not mutually exclusive.\n- Hierarchies and networks constantly give rise to each other.\n    - Wikipedia grew with as a network of knowledge, but the rapid growth forced them to develop a hierarchy to govern the process of adding information.\n- Generally hierarchies are effective for large-scale environments and networks are useful for small-scale and rapid changing environments\n\n- Hierarchies are resilient, but it limits possibilities for interesting connections (that networks enable)\n    - The purpose of tagging here is not to replace hierarchies but to complement it. To enable exploring interesting connections within a resilient structure of a hierarchy.\n\n- Tags as virtual spaces.\n    - Think of tags as _tunnels_ through our knowledge connection.\n\n- In a way tags give you a notion of \"space\" in your notes.\n- The Intelligent Use of Space. ([read later](https://adrenaline.ucsd.edu/Kirsh/Articles/Space/AIJ1.html))\n    - Ways physical space can be utilized:\n        1. To simplify perception\n        1. To simplify choice\n        1. To simplify thinking\n    - These are the same things tags promise to provide.\n        - Facilitating actions is important here.\n\n- Tagging for the knowledge lifecycle\n    - Labeling the conceptual meaning of a knowledge is labor intensive.\n    - Track the lifecycle of a note with tags instead.\n        - e.g.)\n            - Identifying knowledge\n            - Capturing knowledge\n            - Verifying knowledge\n            - Interpreting knowledge\n            - Organizing knowledge\n            - Categorizing knowledge\n            - Disseminating knowledge\n            - Combining knowledge\n            - Creating knowledge\n            - Using knowledge\n            - Re-evaluating knowledge\n    - Benefits of this: \n        - You only have a few of them, and they rarely change.\n    - Not a new idea.\n        - Robert Horn's \"Information Mapping\" (1969)\n    - The overarching goal of knowledge collection is to put it to use in real projects.\n    - On the surface, information mapping looked like something that would make writing easy, but it also makes reading easy.\n    - Best use for labesl is an _output mechanism_, not an input mechanism.\n        - By labeling our notes when they are being used, instead of when they are created, we move the work of tagging as close as possible to the problem it is meant to solve.\n\n- In the context of PKM\n    1. Tag notes according to the actions taken or deliverables created with them\n        - What action(s) have you taken (or will you take) with this note?\n            - #reviewed\n            - #added\n            - #read-later\n        - What have you used (or will you use) this note to deliver?\n            - #blog-post-1\n        - Which stage is this note currently in (or does it best belong to)?\n            - #inactive\n            - #active\n            - #next\n        - It should answer \"is this relevant to my need?\"\n    1. Add structure slowly, in stages and only as needed, using accumulated material to guide you in what structures are needed\n        - tempting to organize upfront and stick with it no matter what.\n        - but it won't be perfect.\n        - digital information is malleable. change as you go.\n        - as notes accumulate, gently introduce tags that make sense for the pattern that arises.\n        - it is perfectly okay to _not_ tag a note at all.\n    1. Tag notes according to their internal, external, and social context, and status\n        - https://mitpress.mit.edu/books/science-managing-our-digital-stuff\n        - Internal context\n            - thoughts, feelings, associations, concerns, considerations you have about the note\n        - External context\n            - other notes, documents, folders, apps\n        - Social context\n            - other people who are related to the note. collaborators, source, shared\n        - Current status\n            - actions taken with the note, deliverables.\n    1. Develop customized, profession-specific taxonomies\n        - Over the history of information, the goal of taxonomies and categorization was to create a single, complete, comprehensive ordering of knowledge that any future idea can be placed into.\n            - Explosion of information has rendered this goal unacheivable.\n            - Too broad to be useful, too narrow to be universal\n        - for specific fields taxonomies have value.\n\n- Scalability\n    - it is only necessary to use tags when there are a lot of notes.\n    - tags can provide essential metadata tha computers still cannot determine (what the note is _about_)\n\n- Ambient findability\n    - Peter Morville's book (https://www.amazon.com/Ambient-Findability-What-Changes-Become/dp/0596007655)\n    - the practice of creating environments where relevant info can be found and used\n    - Tags were a product of a different era\n        - A computer's time was more precious than a human's, so we sweated every keyword.\n        - But today's goal is to spend computing power, not conserve it.\n        \n","n":0.035}}},{"i":35,"$":{"0":{"v":"Cerebrarium","n":1},"1":{"v":"\n![](/assets/images/2020-12-20-14-44-18.png)\n\n# Cerebrarium\n\n> **Where I sow my cerebral seeds and tend to them.**\n\nThis is my current attempt to _**actively consume**_ information,\nand also try to travel back in time and excavate what I have been dumping into my head without any consideration.\n\nMost of the documents here will not make sense as they are working copies of my projects and ideas. This page is the entrypoint to my thoughts but there isn't a clearly sorted order of navigation. I simply decided to share these publicly to facilitate easy sharing and _**thinking out loud**_\n\nI plan to keep more polished and complete posts in my [main website](https://markhyunikchoi.com) and use this place as a nursery for my thoughts.\n\nThis is my [[PARA|cerebrarium.pkm.para]], my [[Zettelkasten|cerebrarium.pkm.zettelkasten]], my second brain. This is my Eudaimonia Machine. This is my kitchen-sink-crucible of tools that hopefully helps me think better. \n","n":0.085}}},{"i":36,"$":{"0":{"v":"Guide to tending the Cerebrarium","n":0.447},"1":{"v":"\n- [[Prune a random note|cerebrarium.tending.prune-a-random-note]] if you feel lost. You will eventually hit a note you want to work on right now.\n- If you have something you want to write but can't decide where the note belongs, start dumping them in the [[buffer note|cerebrarium.pkm.buffer-notes]].\n","n":0.151}}},{"i":37,"$":{"0":{"v":"Prune a Random Note","n":0.5},"1":{"v":"\nOpen a random note. Does this note deserve to stay?\n\nIf the answer is no, it has to be pruned.\n  - Maybe you wanted to get to this topic, but never did.\n  - It might have been relevant, but it probably isn't anymore.\n    - You will get back to it if it becomes relevant later.\n  - :exclamation:  It is already overwhelming to only spend time on stuff that you actively care about.\n\nIf the answer is yes, ask again: Do you need to work on it?\nSome notes are good as is. It is complete. You may be able to improve it later if new ideas emerge, but you don't have to force it.\nSome notes do need to be tended. It may be overgrown or undergrown. Make explicit goals and extract actionable tasks to acheive that goal for the note. Read up on it. Make it a new project.\n\nIt might also be a good idea to give notes a status so later on when you stumble upon it you know what to do immediately.\n  - Be careful not to fall into the trap of tagging excessively. Think about the absolute minimum set of statuses. Refer to [[Taggig is Broken|ext.tagging-is-broken]].\n\nTry going to the parent node after opening a random note.\n- A lot of the times the parent, along with the children also needs to be pruned.\n- A good way to nip off some dead branches faster.\n","n":0.066}}},{"i":38,"$":{"0":{"v":"Self","n":1},"1":{"v":"\n# self\n> A collection of shallow to deep self-reflections on various topics of life.\n","n":0.267}}},{"i":39,"$":{"0":{"v":"Supplements","n":1},"1":{"v":"\n# Dietary supplements\n\n- MSM\n- Silymarin\n- L-Theanine\n- Vitamin B Complex\n- Omega 3\n","n":0.302}}},{"i":40,"$":{"0":{"v":"Motivation","n":1}}},{"i":41,"$":{"0":{"v":"Meditation","n":1}}},{"i":42,"$":{"0":{"v":"Being Present","n":0.707},"1":{"v":"\n\n# Being Present\n\n- Stillness in thought, fully observing what is here and now.\n- Focusing on what is currently happening both internally and externally.\n\n- [[Anxiety|cerebrarium.self.anxiety]] is not possible if you focus on being present, because anxiety is an anticipation of the future, the anticipation that the future will not be favorable to you, unpleasant, or sad.\n\n","n":0.135}}},{"i":43,"$":{"0":{"v":"Discipline","n":1}}},{"i":44,"$":{"0":{"v":"Anxiety","n":1},"1":{"v":"\nNotes on [this video](https://www.youtube.com/watch?v=qvaB2d5yDf8)\n  - Anxiety and stress is our brains capacity to predict danger.\n    - An opportunity to look into to the future and be prepared for the possible outcomes.\n    - Usually focused on negative consequences.\n  - It exists for a reason. It gives us the ability to avoid them.\n\n  - Anxiety involves _you_.\n    - Consequences _you_ are anticipating to happen, and the preventative actions _you_ may or may not take.\n    - Insecurities.\n\n  - Anxiety is a future-focused mind.\n    - Some people may think they are worried about something that they did / happened in the past, but what they are doing is they are looking at the event that happened in the past and projecting the consequences into the future.\n\n  - Since anxiety is the ability to make predictions, the more you are capable of predicting what is going to happen, the worse your anxiety is.\n\n  - Response to anxiety.\n","n":0.081}}},{"i":45,"$":{"0":{"v":"Action","n":1},"1":{"v":"\n2021-08-01 03:46\n- This is my primary goal for keeping my digital garden.\n  - To organize my thoughts and extract immediately actionable items out of it.\n\n- I usually have very big ideas and not enough momentum to deliver or act accordingly.\n- Classic debate of what drives people to do stuff:\n  1. It's motivation that does this.\n  2. It's discipline.\n\n- _Being motivated_ seems to be the more romanticized choice for people.\n- _Having discipline_ is taxing. It's dreadful and boring.\n\n- Nowadays I tend to believe that motivation does not end up with action. I have proved by brainwashing myself with motivational videos, thoughts and books multiple times and still not picking up my pen throughout my life.\n- I believe and been telling myself and others that discipline is what really drives action, but I don't seem to be disciplining myself that much.\n\n2021-08-01 04:32\n- One bit of fact that I've heard somewhere is that [[anxiety|cerebrarium.self.anxiety]] keeps you from tasks that need considerable commitment.\n\n- I do feel like I have to dissect this properly starting with a proper definition of [[motivation|cerebrarium.self.motivation]], [[discipline|cerebrarium.self.discipline]], and the likes because they are all somewhat interchangeable in a sentence if I don't.\n\n","n":0.072}}},{"i":46,"$":{"0":{"v":"Pkm","n":1},"1":{"v":"\n> Everything related to Personal Knowledge Management.\n","n":0.378}}},{"i":47,"$":{"0":{"v":"Zettelkasten","n":1},"1":{"v":"\n- Zettelkasten is a popular method among academics and writers. I am neither of those (at least as a profession).\n- I do however write for myself. With the breadth of topics and interests I have, it has been proven for many years (of my experience) that I cannot keep up with it.\n- The main audience I want to reach is my future self and possibly the few people who are interested in looking into my brain while I [work with my garage door open](https://notes.andymatuschak.org/z21cgR9K3UcQ5a7yPsj2RUim3oM2TzdBByZu).\n- Not all of this will have a end result of a piece of writing shipped. Some of these will become an art piece, a habit, or a dish; generally anything that is a part of my life.\n- In a more generalized sense, the main outcome of my Zettelkasten will be _actions_. From notes I take while I absorb various information, I aim to extract actions that I can take so that my act of reading doesn't stop at just reading. Not all reading should end up in something actionable, but I will carefully and actively curate what I absorb so that at some point in my knowledge work, it leads to an action.\n  - This action in turn, could end up becoming an art piece, a habit, or a piece of writing.\n  - It is then crucial for me to adapt other action-oriented methods such as GTD or PARA along with Zettelkasten.\n    - One could say Zettelkasten implicitly is couple with the act of writing. This seems true. I am aiming to generalize this to my other interests incrementally.\n\n## Fleeting notes and literature notes\n- I take notes in a lot of places: my phone (a quick message to myself), on a piece of paper, a pocket notebook, etc.\n- Once they serve their purpose, I delete them. I don't think it's worth storing them in a central place.\n","n":0.057}}},{"i":48,"$":{"0":{"v":"Visual Knowledge Management","n":0.577},"1":{"v":"\n# Explore possibilities of using PKM tools for visual art\n\n- Creating (visual) art can seem like a pretty intuitive and impromptu task, but in reality there are a lot of similarities between visual art and writing. \n  - Like writing, there is a whole spectrum of artist that on one end start a drawing from a blank paper and goes by their gut feeling, and on the other end, meticulously build up their visual libraries and accumulate studies on various topics until they reach to their final goal.\n- In the end, both are creative processes.\n\n- It would be interesting to see how the pkm tools can be adapted for people in the visual art world.\n\n","n":0.093}}},{"i":49,"$":{"0":{"v":"Pen and Paper","n":0.577}}},{"i":50,"$":{"0":{"v":"Para","n":1}}},{"i":51,"$":{"0":{"v":"Buffer Notes","n":0.707},"1":{"v":"\n- Buffer notes are notes used to temporarily store any content before it is moved to another place.\n- This is analogous to the concept of [data buffers](https://en.wikipedia.org/wiki/Data_buffer).\n- The main point of using the buffer note is to eliminate the friction of note taking by deferring the decision of note location or structure of the note from the note taking process that requires immediacy.\n- For the buffer note to be useful, the note taking tool needs to support a way to flush out the content of the note in its entirety, or partially to another location easily when later down the line you have decided where the content should go.\n","n":0.096}}},{"i":52,"$":{"0":{"v":"Ameoba","n":1},"1":{"v":"\nhttps://www.dendron.so/notes/e780000d-c784-4945-8e42-35218a3ecf10.html\n","n":1}}},{"i":53,"$":{"0":{"v":"Music","n":1},"1":{"v":"\n# Music\n\n- [[Synths|cerebrarium.music.synth]]\n","n":0.577}}},{"i":54,"$":{"0":{"v":"Synth","n":1},"1":{"v":"\n# Modular synthesis\n\n## modulargrid\n\n- Modulargrid is a modular synthesizer planner that has a database of most if not all modular synthesizer modules of various formats. It makes planning and sharing your system easier.\n- Here is my [current setup + plans](https://www.modulargrid.net/e/racks/command_center/153381)\n","n":0.158}}},{"i":55,"$":{"0":{"v":"Module","n":1},"1":{"v":"# Modules\n\n## Standalone\n\n- MakeNoise 0-coast\n- Monome Norns (shield)\n\n## Eurorack\n\n- Expert Sleepers ES-9\n- RYK M185\n- Frequency Central Klang Stadt\n- North Coast Synthesis MSK007 Leapfrog Filter\n- DivKid SSF RND STEP\n- Mutable Instruments Peaks\n- Westlicht Performer\n- Manhattan Analogue DTM\n- 4MS Rotating Clock Divider\n- [[Mutable Instruments Veils|cerebrarium.music.synth.module.veils]]\n- [[Monome Teletype|cerebrarium.music.synth.module.teletype]]\n- Pittsburgh Modular Double Helix Oscillator\n- [[Mutable Instrument Kinks|cerebrarium.music.synth.module.kinks]]\n- Antumbra FADE\n- Mutable Instruments Plaits\n- Mutable Instruments Stages\n- Extralife Instruments Super Sixteen\n","n":0.124}}},{"i":56,"$":{"0":{"v":"Veils","n":1},"1":{"v":"# Mutable Instruments Veils 1\n\n[Official website](https://mutable-instruments.net/modules/veils1/)\n\n- Veils provides four vcas with an adjustable response curve.\n\n## Build notes\n\n2020-12-31 8:00 PM\n\nIt seems like the Eurorack gods don't want me to have vcas.\n\nEvery time I decide to build a new module I forget that I need a VCA. Maybe it's because I find it boring? It's an essential part of a modular system but on paper it's such a simple device.\n\nThis time I finally remembered to plan a Veils build, but I recieved a blemished panel, which rubbed me in the wrong way. Coincidentally, good panels are out of stock and I will have to wait a few weeks / months to get a replacement. Many angry e-mails have been sent back and forth with the vendor.\n\nI eventually calmed down and ordered the required components for the build. However I realized later on that the PCBs are a 0603 adaptation of Veils and I ordered 0402 components. Some kind of karma I guess.\n\nThis is not a huge problem though. I have a few options from here.\n\n1. Build it with 0402 components anyways\n2. Use this as an opportunity to learn how to order pcbs / fr4 panels from a pcb manufacturing service.\n\nBoth are viable options, but since Veils v2 hardware designs are released, I want to try ordering pcbs and panels for that instead of these. My original intention for building the v1 was to at least have VCAs in my system while I wait for v2.\n\nAll components other than the 0402 packages seem to be identical. I just have to try to fit the 0402 packages between the pads spaced for 0603. This will be a bit tricky because I have to figure out how much solder paste I have to apply for each pad to compensate for the spacing difference. Luckily, I have two to build.\n\n2020-12-31 8:43 PM\n\nShortly after I realized I ordered wrong packages for the build, I had to find something to control my frustration. The blemish panels for Veils was giving me bad vibes and I didn't want to look at them again. \n\nSo I grabbed a sanding disc and started peeling off the anodization and silk screen. After a few angry passes and then some with a finer grit, it looked pretty good. Not a perfect finish but miles better than looking at a b-stock panel.\n\n![](/assets/images/2020-12-31-21-30-50.png)\n_blemish panel vs sanded panel_\n\nThe finish isn't perfect, but I like the gritty look of the raw panels. I could keep it as is or polish it more. Maybe sticker bomb it? It will be a good panel to experiment stuff on.\n\nI should look into making my own [[panels|cerebrarium.music.synth.diy.panels]]\n\n2021-01-06 11:15 PM\n\nThe components arrived. 0402 components are... way too small.\nI'll wait until the weekend to try building one of the veils.\n\nLooks like the 0603 adapted pads have just enough space to fit a 0402 components between them, so it's definitely possible to use the original size.\n\nI tried picking one of the resistors up with a tweezer and to my surprise, I think the static makes it stick to the tweezers. I guess they aren't ESD like they are advertized?\nI always clean them with IPA so it's not sticking onto the residual flux for sure.\n\n2021-01-09 3:20 PM\n\n- Started building.\n- Sorted components by size.\n    - 0402 resistors\n    - 0402 capacitors\n    - the rest\n\n2021-01-09 3:48 PM\n\nFinished applying solder paste\n\n![](/assets/images/2021-01-09-15-49-23.png)\n\n2021-01-09 6:47 PM\n\nComponents all placed\n\n![](/assets/images/2021-01-09-18-47-54.png)\n\n2021-01-09 7:06 PM\n\nFlow on heat plate.\n\n- preheat to 100C\n- place pcb around 85C\n- when 100C reached, crank up to 230C\n- flow complete around 215C\n- turn off heatplate, keep pcb on plate\n- take pcb of plate\n\n![](/assets/images/2021-01-09-19-07-27.png)\n\n2021-01-09 7:16 PM\n\nInspection\nlooking for bridges, inconsistent joints, and any shorts.\n\n![](/assets/images/2021-01-09-19-17-09.png)\n*bridges on IC*\n\n![](/assets/images/2021-01-09-19-18-35.png)\n*capacitor stands up and only soldered to one pad*\n\n![](/assets/images/2021-01-09-19-20-20.png)\n*inconsistent solder amount of each pad*\n\n![](/assets/images/2021-01-09-19-21-38.png)\n*balled up joint and resistor trying to escape*\n\n2021-01-09 9:12 PM\n\n- soldered all through-hole components after checking for shorts\n- tested each channels individually for functionality before soldering. worked fine\n\n2021-01-10 2:14 AM\n\n- Individual channels worked fine but daisy chaining was a bit wonky.\n- After hours of troubleshooting with a few friends, narrowed it down to a problem occuring between the cascade mixing of channel 2 and channel 3\n- As a result, channels 3 and 4's outputs were weaker and inverted.\n![](/assets/images/2021-01-10-02-18-51.png)\n*channel 2, 3, 4 output signal should be identical to channel 1's output signal, but channel 3 and 4's output are inverted and weak (dim and green)*\n\n- After many solder joint touch-ups, identified IC4's pins 8 and/or 9 were the culprit.\n- What was happening, was the 2 OPAMPs between channels 2 and 3 were inverting the signal twice while gain staging, and the second OPAMP had a faulty solder joint. which lead to the signal not inverting back, and also going through a nearby resistor which made it weak.\n\n- working as intended now\n\n![](/assets/images/2021-01-10-02-25-01.png)\n*finished module*\n\n# Build debrief\n- \n","n":0.036}}},{"i":57,"$":{"0":{"v":"Teletype","n":1},"1":{"v":"# Monome Teletype\n\n[Official website](https://monome.org/docs/teletype/)\n\n[Repo for software](https://github.com/monome/teletype)\n\n[Repo for hardware](https://github.com/monome/teletype-hardware)\n\n## build log\n\n- purchased panels and pcb on 2020-11-30\n- purchased components on 2020-12-19 (digikey)\n    1. PLP1-350-F x 8 backordered\n    2. AD5687RBRUZ x 2 backordered\n- purchased missing components on 2020-12-29 (mouser)\n    1. PLP1-350 instead of PLP1-350-F\n        - Round lens instead of flat lens\n        - All other dimensions are identical and should fit\n\n## notes\n\n2020-12-31 9:31 PM\n- This build uses 2-56 screws and standoffs (Mcmaster 91780A023, 91772A077, 91772A073) that are kind of hard to find. Had to look for the datasheets for these and order alternatives. Hopefully they will fit.\n\n- Along with the [[Veils panels|cerebrarium.music.synth.module.veils]], the panels for these were scratched. Perpendicular to the aluminum brushing. I suspect poor packaging on the seller's end. It was shoved in a plastic baggy barely big enough to fit both the panels and the pcb with no other protection (just in a box with a dozen more pcbs and panels). I was more frustrated with the poor quality of the Veils panels so I didn't mention these. \n\n2021-01-06 11:19 PM\n- Rest of the components that were missing arrived with the veils component order.\n- I'm pretty excited for this build. It's pretty much a blank slate module that can do anything I can think of and code.\n\n2021-01-10 2:53 PM\n- Compiled the IBOM for Teletype with Eagle.\n- Sorted and checked all needed components.\n- **SW40 and ISP not needed.**\n\n2021-01-16 4:14 PM\n- Started applying solder paste \n\n2021-01-16 4:58 PM\n- Finished applying solder paste\n- Started placing 0402 resistors\n\n2021-01-16 5:52 PM\n- Finished placing all 0402 resistors\n- Started placing 0402 capacitors\n\n2021-01-16 6:34 PM\n- Substituted C27 (100n ceramic capacitor) with a 100n ceramic capacitor with a higher working voltage rating\n\n2021-01-16 7:08 PM\n- Finished placing all capacitors\n- Started placing diodes\n\n2021-01-16 7:20 PM\n- Finished placing diodes\n- Started placing LEDs / etc.\n\n2021-01-16 7:43 PM\n- Started placing ICs\n\n2021-01-16 8:13 PM\n- All SMD components placed\n\n2021-01-16 8:16 PM\n- Start up heat plate. Warm up to 100C\n- Placed PCB around 85C mark\n\n2021-01-16 8:25 PM\n- Crank up to 230C\n\n2021-01-16 8:35 PM\n- Turned heat plate off.\n- Cooling PCB down on the heat plate.\n\n2021-01-16 8:46 PM\n- Removed PCB from heat plate.\n- Cooling down on a cold metal surface.\n\n2021-01-16 9:38 PM\n- Inspection time\n- Bare eyes:\n    - I seem to have figured out an optimal amount of solder paste application.\n        - Most of the pads have perfect joints.\n    - Bridges on tight chips are inevitable with solder paste.\n- Microscope\n    - Some pads on the edge of the board aren't fully flowed and need touch-up\n    ![](/assets/images/2021-01-16-21-43-45.png)\n    - Balled up joint. This is a problem with component placement, or the amount of paste on one side of the pad. Usually the component will stand up on it's own if there was too much solder paste on one side though\n    ![](/assets/images/2021-01-16-21-49-42.png)\n    - Another ball-up. This one is a bit subtle but from the sides I can see that the resistor is slightly lifted on one side. The balled up side actually does not have contact with the pad/solder\n    ![](/assets/images/2021-01-16-21-53-40.png)\n    - This is an odd one. Solder balled up on the component and not on the pad. This is most likely due to dried up solder paste and slightly lifted component.\n    - It's possible that the pad has contact with the component, but I will touch this up just in case\n    ![](/assets/images/2021-01-16-22-07-57.png)\n    - Rouge ball of solder on each side of the 1206 capacitor.\n    - Simply running the iron and dragging it to one side of the pad will fix this.\n    - I can see this on every single 1206 package.\n    ![](/assets/images/2021-01-16-22-09-13.png)\n- Loupé\n    - Another check with a loupé as a microscope is limited to a bird's eye view and its resolution\n\n2021-01-17 12:00 PM\n- Yesterday, after inspection I cleaned up bridges and dry joints.\n- Due to the amount of solder paste, I had to wick away some solder from the bridges on the STM32.\n    - As a result, I took away a bit too much solder, which resulted in a (potentional) dry joint\n    ![](/assets/images/2021-01-17-12-02-42.png)\n    - I remedied this by applying a lot of flux, then dragging the iron along the pins to evenly distribute the existing solder to the pins that have dry joints.\n        - On some sides there weren't enough left to drag around, so I tinned the iron with the tiniest amount of solder and did the same. with enough flux, this will not bridge the pins.\n        - Just the right amount of solder would be left behind on each joint\n        ![](/assets/images/2021-01-17-15-15-26.png)\n- Soldered all the hardware except the potentiometer and jacks.\n- Turns out the DIP socket + pin headers listed in the Bill of Materials for the OLED header lifts the screen a tiny bit too high. There is not enough space between the screen and the panel for the panel to fit.\n    - I could substitue them with low profile sockets, but I didn't have it stocked.\n    - It would have also worked if I replaced only the male headers, but unfortunately these male headers do not fit in DIP sockets.\n    - At this point, my option is to:\n        1. Purchase low profile sockets (mouser reference : [517-929984-01-20-RK](https://kr.mouser.com/ProductDetail/3M-Electronic-Solutions-Division/929984-01-20-RK/?qs=%2Fha2pyFaduh65k0%252BENFIKH%2FjmgqQmrFcQW016WE0H3Ua5m7VtlBHQinfFgBmn0lN&utm_source=octopart&utm_medium=aggregator&utm_campaign=517-929984-01-20-RK&utm_content=3M))\n        2. Pull out a few pins and hack up my own headers.\n    - Safest bet is to go with the low profile sockets. These are the same ones used for the Westlicht Performer.\n- Technically, at this point I could power it up and see if it flashes properly. If it doesn't flash properly, I need to work on the STM32 joints again.\n- I decided to wait until I get the height of the screen properly before flashing, because having a screen just feels better when the module boots up.\n\n2021-01-17 3:18 PM\n- I will have to add the proper headers for the screens in my next mouser cart.\n- I have the Fade, Kinks, Plaits, Stages left to build, so I'll choose one and order the components with the headers I need.\n\n2021-01-22 9:56 PM\n- Replacement headers arrived\n- Desoldering original\n\n2021-01-22 10:59 PM\n- Finished desoldering original\n- It was a pain in the ass\n- Preci-dip 20 pin connectors are a pain in the fucking ass to desolder\n- CHECK LEVELS OF ANY OLED SCREEN WITH THE PANELS BEFORE SOLDERING PIN HEADERS\n- CHECK LEVELS OF ANY OLED SCREEN WITH THE PANELS BEFORE SOLDERING PIN HEADERS\n- CHECK LEVELS OF ANY OLED SCREEN WITH THE PANELS BEFORE SOLDERING PIN HEADERS\n\n2021-01-23 1:03 AM\n- Tried flashing on a Mac. Did not work.\n- Suspected faulty cables (USB-C to A). Was not the case.\n- Switched to Windows. Worked first time (USB-A to A).\n- Soldered the jacks and potentiometer.\n- Realized the screws are too short to reach from the panel to the spacer.\n    - Will have to be like this for now until I order another batch of components\n- CV 3's LED is always on. but it's too late and I'm tired.\n\n2021-01-23 10:07 PM\n- Reflowed CV 3's LED and the components that are in series to it.\n- It is still always on, but when I connect the USB keyboard to the module, it partially works\n    - Unlike other CV LEDs, it's either ON or OFF, it doesn't go from dim to full brightness depending on the voltage\n- Chipped a bit of the LED off while touching it up.\n- I don't know enough about electronics to troubleshoot this on my own. Nor do I have the energy to do this today, so I will leave it here.\n\n2021-01-23 10:05 PM\n- With the help of a friend, narrowed it down to a problem where CV output 3 is recieving high voltage.\n- When given 1 volts as an output, it was receiving 11.9V, thus making it turn brighter than others.\n- Also, the power switch for USB (U1) burned. My first magic smoke!\n    - I guess it couldn't handle my keyboard.\n- I should order replacement for U1 and a cheap usb keyboard.\n\n2021-07-04 14:50\n- This is not logged, but I troubleshot some but still have not finished it. It's been a while.\n- Eurorack is currently on the backburner, so it may take a bit to get back to this.\n","n":0.028}}},{"i":58,"$":{"0":{"v":"Kinks","n":1},"1":{"v":"\n# Mutable Instruments Kinks\n\n[Official Website](https://mutable-instruments.net/modules/kinks/)\n\n[Hardware repository](https://github.com/pichenettes/eurorack/tree/master/kinks/hardware_design)\n\n## notes\n\n2021-01-19 9:09 PM\n- Sourced parts for two builds.\n- Q3 substituted for a renewed(I think) version.\n- 1M ohm resistors substituted as they were backordered.\n- There are some 0.1% resistors and DAMN they are expensive.\n\n2021-07-11 10:24\n- Great little utility module.\n- Sample and hold is a bit droopy.\n","n":0.14}}},{"i":59,"$":{"0":{"v":"Diy","n":1},"1":{"v":"\n# Synth DIY\n\n## Checklist\n### Ordering components\n#### Global\n- [Mouser](https://www.mouser.com/)\n- [Digikey](https://www.digikey.com/)\n- [Thonk](https://www.thonk.co.uk/)\n- [Aliexpress](https://aliexpress.com/)\n\n#### South Korea\n- [Devicemart](https://www.devicemart.co.kr/)\n- [Eleparts](https://www.eleparts.co.kr/)\n\n### Before you start\n### During the build\n### Before plugging in\n### Flashing and calibration\n\n## Ideas\n- Analog VU meter array\n    - An array of 4 or 8 Analog VU meters\n    - Audio in / out / multiple\n    - Backlight switch\n    - Attenuation (faders? knobs?)\n    - doesn't have to be eurorack format\n- Learn how to order pcbs / FR4 panels from JLCPCB\n","n":0.117}}},{"i":60,"$":{"0":{"v":"Panels","n":1},"1":{"v":"\n# Panels\n\n## Aluminum\n### Useful links\n[Finishing Aluminum Panels](https://syinsi.com/finishing-aluminum-panels/)\n\n## FR4\n- [How to Make Inexpensive Module Front Panels](https://www.youtube.com/playlist?list=PLJp3U60JASHlc7BVpB8VUkJoczbGfWs8p)\n- [A TUTORIAL ON \"MAKE NOISE\" STYLE INDICATOR LIGHTS AND DESIGNING AN ILLUMINATED BLIND PLATE USING KICAD](https://www.threetom.com/news/a-tutorial-on-make-noise-style-indicator-lights-and-designing-an-illuminated-blind-plate-using-kicad/)\n","n":0.18}}},{"i":61,"$":{"0":{"v":"Language","n":1}}},{"i":62,"$":{"0":{"v":"English","n":1},"1":{"v":"\n# English\n","n":0.707}}},{"i":63,"$":{"0":{"v":"Vocab","n":1},"1":{"v":"\n# Vocabulary\n\n> List of words and phrases that I hear or read that are not yet in my everyday lexicon.\n\n- It may be worthwhile looking into spaced repetition for these words, but I am not too invested in expanding my lexicon just yet.\n    - I am pre-emptively compiling this list so if one day I want to work on this I can.\n\n## I don't know what it means.\n\n- Decorum\n    - Behaviour that is controlled, calm, and polite.\n    - _The witness endured the lawyer’s badgering with remarkable decorum._\n\n- Frivolity\n    - lack of seriousness; lightheartedness.\n    - _a night of fun and frivolity_\n\n- Pageantry\n    - elaborate display or ceremony.\n\n- Minutiae\n    - Minor detail\n    - _Don't get bogged down with the minutiae of everyday life._    \n\n## I have a vague idea of what it means but it's not fully registered in my brain.\n\n- Come to pass\n    - To happen. What is happening is the result of a course of events.\n    - _I doubt if his promises will ever come to pass._\n\n- Begrudgingly \n    - unwillingly, often because you have no choice.\n    - _They are friendly, helpful and never act like they are begrudgingly helping you_\n\n## I do have perfect understanding of the meaning, but it is not yet incorporated in my lexicon.\n\n- Structural integrity\n    - _The structural integrity of a burger is of utmost importance_\n- Prodigious\n    - Extremely great in ability, amount, or strength.\n    - _She wrote a truly prodigious number of novels._\n- Tether to reality / tether on reality.\n- Burning a hole in one's pocket\n    - Very eager to spend as soon as possible.\n","n":0.062}}},{"i":64,"$":{"0":{"v":"Botany","n":1},"1":{"v":"\n# Botany\n","n":0.707}}},{"i":65,"$":{"0":{"v":"Resources","n":1},"1":{"v":"\n# Resources\n\n[Caudiciform & pachycaul succulents](https://openlibrary.org/books/OL2255192M/Caudiciform_pachycaul_succulents?fbclid=IwAR1oM8QQNkrUfOwZwiMrvfg7MKWX8qD8ENbd_94dB7vkDElTW1qIdK82WE4)\n[Madagascar plant cultivation basics](https://sabotenauction.blogspot.com/p/blog-page_4.html)\n[review of the book: 多肉植物&コーデックス GuideBook](https://botanicalog.net/archives/9890)\n[Pachypodium and succulent book review](https://inuairon.com/pachypodium-agave-recommend-books/)\n","n":0.243}}},{"i":66,"$":{"0":{"v":"Plants","n":1}}},{"i":67,"$":{"0":{"v":"Senna","n":1}}},{"i":68,"$":{"0":{"v":"Meridionalis","n":1}}},{"i":69,"$":{"0":{"v":"Phyllanthus","n":1}}},{"i":70,"$":{"0":{"v":"Mirabilis","n":1},"1":{"v":"\n\n## links\nhttps://www.plantisuss.com/post/phyllanthus-mirabilis-beginner-care-guide\nhttps://plantipelago.co/loveyourplants/phyllanthus-mirabilis/\nhttps://greg.help/plant-care/phyllanthus-mirabilis\nhttps://www.ukhouseplants.com/plants/phyllanthus-mirabilis\nhttp://www.llifle.com/Encyclopedia/SUCCULENTS/Family/Euphorbiaceae/31734/Phyllanthus_mirabilis\nhttps://www.youtube.com/watch?v=8tqkD1YAOlw\n","n":0.707}}},{"i":71,"$":{"0":{"v":"Pachipodium","n":1}}},{"i":72,"$":{"0":{"v":"Gracilius","n":1},"1":{"v":"\n# Pachipodium Gracilius\n\n[codex green gracilius series](https://codexgreen.com/category/raise/gracilius-seedlings)\n","n":0.408}}},{"i":73,"$":{"0":{"v":"Operculicarya","n":1}}},{"i":74,"$":{"0":{"v":"Pachypus","n":1},"1":{"v":"# Operculicarya Pachypus\n\nThis is the king of caudex (in my opinion).\n\nEver since I've discovered the wonderful world of caudiciforms, I've been drooling over the idea of obtaining a Pachypus.\n\nThis is a plant endemic to Madagascar, and is very tricky to root after importing.\nThe soil is removed and the roots and so-called `power tank` is cut to prevent the soils from entering the destination country.\n\nToday (2021-02-27) I visited my [go-to store](https://www.goreplantseoul.com/) for caudices to potentially purchase a small senna meridionalis (which I did), and the owner kindly offered me to pick up a unrooted, possibly dead Pachypus for free.\n\nI figured I would dare try to root it and if I fail it still is an absolutely beasty looking plant so I could keep it as a trinket or decoration.\n\nThis is a tricky plant and not a lot of information is out there on the interent.\nThe most actively discussed place seems to be Japan, and I am now maniacally searching the web for japanese caudex blogs for 発根管理(root management) of pachypuses.\n\nWhat I have gathered so far is the following:\n\n1. Good draining soil.\n2. Soak in root conditioner before potting.\n3. Keep pot warm. mid 30 degrees celcius.\n4. Water when soil just barely gets dry.\n5. Spray HB-101 and the likes and water several times a day\n6. Be patient and enjoy the ride.\n\nTo be completely honest I have no expectation of successfully rooting this beast as even for fresh and well maintained imports the success rate is supposedly 10%\n\nSince I am not confident in rooting a Pachypus (or even any plant in that matter), I would go with the advice of [this post](https://twelvedesign.jp/2019/07/05/operculicarya-pachypus-pet-bottle-1-2/) and use a transparent pot to at least give me a visible indication of how the roots are doing.\n\nNow I need to mix up a suitable well draining soil.\nFor this I am following the advice of [this post](https://inuairon.com/pachypodium-soil/)\n\nFor heating, I've considered wrapping the pot with a heated blanket, buying a sous-vide machine and submerging the pot, just having a heated blanket below the pot, etc.\n\nthe sous-vide machine method I now realize cannot be done as we cannot effectively drain the pot, and I'm scared of the humidity.\n\nI'm also a bit scared of the fire hazard of wrapping the heated blanket AROUND the pot, as I think it's not meant to be bent while using.\n\nI will have to use a heated blanket just under the pot and maybe wrap the pot with some heat retaining material so that the soil is evenly heated throughout the day.\nI think they sell pads for pots but [this post](https://inuairon.com/pachypodium-rooting/) shows me you can use a heating pad for reptiles. In [this post](https://codexgreen.com/unexplained-pachypus_purchase_3/) they use a foot warmer.\n\nI am not sure if I should soak the thing in root conditioner (like clone X or oxyberon) since it was already done by the shop owner. I'm going to go against my gut feeling and skip this as I don't know the effect of doing this repeatedly.\n\n**2021-02-27 11:17 PM**\n\n- Purchased all materials needed for mixing the soil, heating the pot, as well as a plastic.\n\n2021-02-27 11:35 PM\n\n- [codexgreen](https://codexgreen.com/) logs the journey of rooting 4 pachypuses. This is very interesting. Out of the 4, they managed to succeed 3 times. second one being the failure. It is a very detailed log for root managing the plant.\n- I have a very dangerous feeling that I'll be sucked into this more deeply... The glorious feeling of successfully rooting a Pachypus and then seeing fresh leaves sprouting is something I want to experience myself.\n- The only thing that holds me back is the sheer cost and risk. It seems like starting with a healthy, strong stock is vital for success, and this means getting a larger stock that can survive the stress while importing / rooting. This also means that I will have to shell out a big chunk of money to source this, which I am currently not ready to do.\n- My best bet is to pretend what I currently have in hand has a possibility to survive, and to try out the seedlings.\n\n**2021-03-01 1:48 PM**\n\n- Various links I need to check and organize later.\n  1. <https://www.youtube.com/watch?v=md2dAL4KA4Y&list=PLbYpW8fSpTviLfVUf1WOinmR52xmbXfkx&index=2>\n  2. <https://www.youtube.com/watch?v=iS9FkSXIxuM>\n  3. <https://www.youtube.com/watch?v=gRXBspb4ibE>\n  4. <https://inuairon.com/pachypodium-rooting/>\n  5. <https://inuairon.com/pachypodium-soil/>\n  6. <https://inuairon.com/pachypodium-how-to-grow/>\n  7. <https://inuairon.com/vinyl-house-small-and-durable/>\n  8. <https://codexgreen.com/unexplained-pearsonii_purchase_5/>\n  9. <https://www.youtube.com/watch?v=md2dAL4KA4Y>\n\n**2021-03-28 10:28 PM**\n\n- Quite a bit of time has past since I started looking into pachypuses (pachypi?), but along the way I decided there is no way this is going to survive so I just left it as is.\n- However, I did purchase a very small and not-tubular pachypus for a relatively cheap.\n  - It is currently getting used to the environment and has several bits where the new leaves are about to form.\n- Also, apparently there will be a bulk sale of yet-to-be-rooted pachypuses at a new store.\n- So now I'm coming back to the topic and trying to gather information so I can be prepared to try out rooting it myself.\n- link to the [[project log|proj.pachypus-prep]]\n","n":0.035}}},{"i":75,"$":{"0":{"v":"Decaryi","n":1},"1":{"v":"\n\n# Operculicarya Decaryi\n\n","n":0.577}}},{"i":76,"$":{"0":{"v":"Dorstenia","n":1}}},{"i":77,"$":{"0":{"v":"Foetida","n":1}}},{"i":78,"$":{"0":{"v":"Dioscorea","n":1}}},{"i":79,"$":{"0":{"v":"Elephantipes","n":1},"1":{"v":"\n\n[Wikipedia](https://en.wikipedia.org/wiki/Dioscorea_elephantipes)\n\n[caring](https://gardenbeast.com/dioscorea-elephantipes-guide/)\n\n# notes\n\n**2021-01-31**\n\n- Purchased my first dioscorea elephantipes\n- Estimated to be 7 year old\n- seller comments\n    - recommends watering every 7-10 weeks\n        - adjust depending on how much vine growth you want.\n        - slow down watering to every 2 weeks during the summer.\n    - vines might wither down during the summer, but not always.\n    - the body doesn't grow drastically. just the vines.\n    - it will live up to 70 years.\n\n**2021-04-15 12:55 AM**\n- New link to check out : https://inuairon.com/caudex-dioscorea-elephantipes-how-to-grow/\n- Also, log what you did when there was a mealy bug problem. \n","n":0.104}}},{"i":80,"$":{"0":{"v":"Dioon","n":1}}},{"i":81,"$":{"0":{"v":"Edule","n":1}}},{"i":82,"$":{"0":{"v":"Art","n":1},"1":{"v":"\n# Art\n\n","n":0.707}}},{"i":83,"$":{"0":{"v":"Retrospect","n":1}}},{"i":84,"$":{"0":{"v":"Fear","n":1},"1":{"v":"\n## Takeaway\n- Making art means despite all the hurdles, you find meaning within the _work itself_.\n  - The main hurdle for me doesn't seem to be in artmaking itself.\n    - But I should not rule out the effect of the art related fear that feeds back to my anxiety.\n    - Maybe use art as a vehicle of solving the bigger problems with anxiety.\n  - The larger issue is my general anxiety, which rewires me to seek small and immediately-gratifiable things in place of things that require commitment.\n    - I may need to explore the relationship between anxiety and distraction, commitment.\n- Write a small set of rules, or a manifesto of sort, that can remind you about the root of the fears in artmaking.\n\n## Log\n2021-08-15 13:52\n[[ext.art-and-fear]]\n- This was a wonderful book that taught you about the various fears you would get by being an artists as well as what it meant to be an artist.\n- The first part of the book was very interesting and useful for me, but part 2 was mostly irrelevant, so I have omitted it from summarizing them.\n  - About career and academia within the art field.\n  - I may get back to it if I ever get involved in that, but not for now.\n- Main points that resonated with me:\n  - [[Making art means facing uncertainties and doubts|ext.art-and-fear.chapter-1#^KyVEyFcV2lyU]]\n    - I think this is a very practical definition.\n    - As a person with a lot of anxiety in general, I am very prone to avoid things that are uncertain. Uncertainty paralyzes me. I think this is part of the root cause of what I've been struggling to figure out.\n      - As much I love and fantasize about making art, it doesn't come as easy. I have very short bursts of drive for making art which quickly dwindles down.\n    - The book goes straight to the point, and is very convincing:\n      - [[Making art means despite these hurdles you find meaning within the work itself|ext.art-and-fear.chapter-1#^GBvJ5I9iGGqU]]\n\n2021-08-16 01:29\n[[Chapter 1|ext.art-and-fear.chapter-1]]\n- The first chapter establishes some assumptions the authors are making in order to describe what the fears are and what it means.\n  - [[Artmaking involves skills that can be learned|ext.art-and-fear.chapter-1#^AcUEhhFXDSys]]\n    - A typical cliche advice that people give to struggling artists, but the important distinction is that they emphasize that _accepting yourself_ and _following your own voice_ is something that can be learned, and thus means _being an artist is something that you can teach yourself to do_.\n  - [[Art is made by ordinary people|ext.art-and-fear.chapter-1#^vc0OUGjsSfn4]]\n    - Describes the common pitfalls all artists fall into: believing that the _good_ ones are special. Also a cliche advice, but the reasoning is interesting.\n      - That it is _necessary_ to be an ordinary person to make art, because it is what drives the artist.\n  - [[Making art and viewing art are different|ext.art-and-fear.chapter-1#^YHpWMDrfGp2U]]\n    - What matters to you is what you get out of the process, what matters to others is the end result. This point is further explained in [[Chapter 4|ext.art-and-fear.chapter-4]].\n  - [[The notion of art being a self-expression can be a double edge sword|ext.art-and-fear.chapter-1#^MpBMOMvu6nPo]]\n    - This is something a lot of artists believe, and the danger of doing so is that it's easy to think that you are flawed because your art is flawed (or you think it is).\n    - It's arguable, I generally agree with this, but it feels weaker than the other points.\n- What can I get out of this?\n  - One actionable I can think of is a small manifesto about how I would approach artmaking, that I can come back to whenever I am struggling and need a refresher on what my fears are.\n\n2021-08-23 23:59\n[[Chapter 2|ext.art-and-fear.chapter-2]]\n- [[Quitting means not starting again, but art is all about starting again|ext.art-and-fear.chapter-2#^QgLc00UDcxI2]]\n  - This pretty much sums up everything about chapter 2.\n- The reasons artists quit doesn't really seem to apply to me _yet_, but it may be something that I have to think about later on.\n  - Convincing themselves that their next effort will fail\n  - Lose destination.\n  - I'm probably closer to the former than the latter, because I haven't really found a destination at all yet, and I'm still very much struggling to learn how the materials react to what I do to them.\n- [[Make friends with others who make art, and share your work frequently|ext.art-and-fear.chapter-2#^beDUjUvSguJQ]]\n  - This is prime advice.\n  - I feel like I never had people to share my work, and on any rare occasions I've shared, it felt great and gave me a lot of drive.\n- Some strategies that I can immediately try to implement for myself:\n    1. Remind yourself that it's natural that sometimes the result of executing your vision can be disappointing.\n    2. What you have the most control over is how the material reacts to your input.\n        - Practicing more and just _doing a lot of work_ will give you more control over the material.\n    3. Other than that, it's all about how _you_ react to the uncertainties.\n        - Train yourself to be resilient to surprises and mistakes.\n        - Use this as your advantage: stash these mistakes and discrepancies between your vision and execution and make sure you address that on your next project.\n          - Your next project will have more of those for the next one as well.\n          - _Not_ having those would probably mean another type of artistic death.\n\n[[Chapter 3|ext.art-and-fear.chapter-3]]\n- [[It is impossible to pretend to be an artist|ext.art-and-fear.chapter-3#^rMDCTFEKrQzE]]\n  - You either do art or you don't.\n  - Getting good reactions from your work is a completely separate thing from _being_ an artist. You did the work, you _are_ an artist. Simple as that.\n  - I wonder if I ever thought like this.\n    - I do sometimes think I'm pretending, but it's because I'm not really physically doing any work at all, and just _fantasizing_ about doing it.\n      - I guess it's a valid thing to say in this case.\n      - Probably not healthy to keep that thought lingering around though.\n      - Let's try to use this as a reminder that we are _hesitating_ for some reason, and find a way to put down that first brushstroke.\n        - Once the strokes flow out, this feeling tends to go away from me, which is at least a good sign that I'm not falling into this unhealthy ideation.\n- [[Use the imperfections to your advantage moving forward|ext.art-and-fear.chapter-3#^63VoyHdA8jil]]\n  - Art should be _fueled_ by imperfection, and used as something that will guide you through your subsequent works.\n  - Making note of the things I need to improve and time-boxing my project to a certain deadline could artificially create a cycle where I am incrementally improving myself.\n    - This can be true for both _familiarity of material_, and _how I react to my own work_.\n    - _Aim for 75%_, which is my mantra for everything could also be applied here.\n      - How do we quantify the work we are doing?\n        - I can't quantify _how good_ my work is; at least without a prior definition of my goals.\n          - The goal really has to be quantifiable as well so no good.\n        - If I can come up with a quantifiable goal before I start any project, that would be great.\n          - But this may become yet another blocker for doing actual work and prefering incremental growth.\n          - Can I come up with a rule-of-thumb-ish general goal that I can use for any project?\n        - Trying to come up with this has blocked me from doing any art for the past few weeks. Oh the irony.\n          - Let's wing it for now but come back to this later.\n- [[Annihilation|ext.art-and-fear.chapter-3#annihilation]]\n  - Equating myself to the art I make was something I did in the past, but that was with a big pinch of grandiose sense of self importance. I think I'm past that point and just think of it as a fun thing and just one corner of me as a person.\n    - Definitely an important one, but not something that defines me existentially.\n  - Sometimes I think my imagination has dried out? or not much vivid any more.\n    - When I read a novel or something, it was easy for me to picture what's happening in my head, in a very vivid way. Now it's very hazy if it even happens.\n    - I'm slightly bummed out by that fact, but I'm not sure where I stand with this yet.\n  - The desire to make stuff is definitely strong. But it's not something that stands in front of me these days, I feel.\n    - Whenever I _do_ make stuff, it fills me with joy, but when I don't it doesn't bother me on a surface level (or at least I think it's hiding behind my head and just lurking in the dark, and I'm confused with what I'm frustrated with all the time).\n    - I think just doing it a lot is the natural remedy to this. We'll have to see if it works.\n- [[Maybe making art requires something special that I don't have|ext.art-and-fear.chapter-3#^sgrp0vGhGXdk]]\n  - I definitely did think this way, but on the opposite end of the spectrum.\n  - I thought _I_ had that special something, but I just haven't honed it enough yet.\n    - This is a double edged sword because the momeny you start doubting it, you are oscillating between the two extreme ends of the spectrum.\n  - Now I'm more relaxed with this kind of ideation, but I still do think I naturally have a better-than-average affinity to art than your average Joe.\n  - It's comforting to think that even if some kind of magic exists, it is on a personal level and something that is not that important in actually making art.\n- [[Expectations|ext.art-and-fear.chapter-3#expectations]]\n  - Big expectations on my ability to make art. definitely.\n  - Disillusionment always come after the spike of productivity that I sometimes have with art, which quickly dies down.\n  - [[It is about asking what your _work_ needs, not what _you_ need|ext.art-and-fear.chapter-3#^Jm3ntoEebkD0]]\n    - This is a great way of thinking about this issue.\n    - Ties together with equating your art with your existence. When your work doesn't come out as you would expect, it's the _work_ that needs to be improved, not _you_.\n\n[[Chapter 4|ext.art-and-fear.chapter-4]]\n- [[Fears About Others|ext.art-and-fear.chapter-4#fears-about-others]]\n  - As a hobbyist, I don't think I have this problem too much.\n  - My art is very personal to me, to a point other people's opinion don't matter that much? Maybe because my life doesn't depend on it.\n- [[Understanding|ext.art-and-fear.chapter-4#understanding]]\n  - I don't think the art that I do has any depth yet to be misunderstood by other people. It's just little things that I find fun to draw.\n  - Very fortunate that this is the case.\n  - I may get into more depth with my art at some point, but I will have to come back to this later.\n- [[Acceptance|ext.art-and-fear.chapter-4#acceptance]]\n  - Same thing goes with acceptance. Maybe I'm not throwing myself out there yet to have meaningful (or negative) feedback from other people to feel this.\n\n[[Chapter 5|ext.art-and-fear.chapter-5]]\n- [[Working within the self-imposed discipline of a particular form eases the prospect of having to reinvent yourself with each new piece.|ext.art-and-fear.chapter-5#^n0zxPU5gvZMM]]\n  - This rings truth. Doing a _lot of art_ is the best way to produce _good_ art.\n  - Just like I've been semi-automating a lot of things in my life that I want less overhead before starting, I should do the same with making art.\n  - After all, art is a personal thing and you learn about art by doing it. Making it easier to start doing art is the easiest way to start improving.\n","n":0.023}}},{"i":85,"$":{"0":{"v":"Resources","n":1},"1":{"v":"\n# Resources\n\n## Pixel art\n- https://www.youtube.com/channel/UCC26K7LTSrJK0BPAUyyvtQg\n\n## Color\n- https://lospec.com/palette-list/1bit-monitor-glow\n\n## Painting\n- https://www.youtube.com/watch?v=8mr0W5wu50w\n- https://www.youtube.com/watch?v=aGPnN0Yoldw\n\n## Human anatomy\n- Old notes from CGMA masterclass\n- morpho anatomie\n- https://www.youtube.com/channel/UCjnc0AA4TKE1NiR6oPVGYnw\n- https://coloso.co.kr/illust_webtoon/illustrator_kimrockhe?utm_source=instagram&amp%3Butm_medium=organic&amp%3Butm_campaign=illustrator-kimrockhe_kimrockheinstagram_201203\n- https://www.youtube.com/user/ProkoTV\n","n":0.213}}},{"i":86,"$":{"0":{"v":"Primitive","n":1},"1":{"v":"\n> A library of notes on basic building blocks of art.\n","n":0.302}}},{"i":87,"$":{"0":{"v":"Sphere","n":1},"1":{"v":"\n- Drawing a sphere\n","n":0.5}}},{"i":88,"$":{"0":{"v":"Dot","n":1},"1":{"v":"\n> \"Everything starts from a dot.\" - Wassily Kandinsky\n\n- Mathematically, a dot is a graphical illustration of a nildimensional space (a _point_).\n  - That is, you can't see it really.\n- However, as a primitive building block of art, it's blob of ink (or any medium) that is small enough for the human eye to perceive as a single point in space (which you can see!).\n- Sometimes a dot can be perceived not from explicitly marking a surface with a blob of ink but in relation of two _lines_. Two lines intersecting can create a dot.\n\n- A row of dots arranged becomes a line when it's close enough for the human eye to not be able to perceive the gap between each successive dot.\n","n":0.09}}},{"i":89,"$":{"0":{"v":"Log","n":1},"1":{"v":"\n2021-07-13 11:09\n- Started drawing a female figure from a magazine as a reference (Last Sunday).\n- Intended to do a quick croquis and move on, but the simple sillouette and gesture made me want to add more details\n  - Normally people advise you to move on after a quick capture of the gesture and motion of a figure.\n  - Not sure how I feel about this advice.\n    - Sure, if you want to internalize drawing human figure fast, I think this makes sense. You are deliberately decoupling what outline of the image you are seeing and capturing the essential part of the reference.\n    - But I am approaching human figure drawing from a different perspective:\n      - I do want to get better at drawing human figures BUT my primary interest is to find something out there, develop a skill to replicate that in a believable manner, and then adding my own spin to it.\n  - At some point I would need to grind out the deliberate practices to go past a plateauing progression, but for now I want this to be a _fun_ thing to do, something that _I want to wake up for_.\n\n> Progress as of 2021-07-11\n![](/assets/images/2021-07-13-11-19-21.png)\n\n- Didn't have much time yesterday, but I managed to refine the lines and fix some of the parts that I wasn't happy with.\n  - The shoe was drawn a bit out of perspective and wonky. the bottom of the left shoe was a bit crooked so that was fixed. surprisingly hard. \n    - I should do a study of drawing various style of shoes later.\n    - I wanted the line work to be cleaner, but with a tiny bit of bleed. Adjusted the brush to be slightly more jagged than the typical hard round brush and went over the clean pass once again.\n    - Shirt detail and the obstructed part of the torso (right arm) is somewhere I want to make visible than right now.\n  \n> Progress as of 2021-07-12, fixed shoe.\n![](/assets/images/2021-07-13-11-25-30.png)\n\n2021-07-13 22:25\n- Starting to feel like I'm getting too analytic about my drawing, but as long as I keep this constructive it should be fine.\n- Today I wanted to adjust the proportions and perspectives on the torso\n\n> Notes on torso adjustment\n![](/assets/images/2021-07-14-22-30-11.png)\n\n- I wanted to draw the shirt (blousse?) to be loosly fit and tucked in. The front part of the sillouette was making it look \"puffy\" like someone was blowing air into it rather than _loose_, so I decided it would be better to draw in more exaggerated creases in the fabric\n- It's there, but the creases where the shirt is tucked into the pants should be more promenant. Also adjusting the lines to be closer to the body so as to not make it look too boxy.\n- Given the length of the forearm and the upper arm, there should be a pronounced bump where the elbow is. Otherwise it looks like she has a very long upper arm or very short forearm.\n  - This is the part where I think it becomes important to have a working knowledge and baseline understanding of the [[human anatomy|cerebrarium.art.human-anatomy]]. Definitely not a _primary_ goal for me to internalize this, but definitely a means to get what I want.\n  - First thing I should fix on my next session.\n- Need to develop some _shorthand_ ways to express creases, bunches in fabric. Maybe this deserves some resource gathering and it's own hierarchy (maybe `cerebrarium.art.topics.clothing`. `.techniques`? `.tips`? I need more notes to find a pattern.)\n- The right arm being obstructed by the body was throwing off the perceived perspective of the figure. I got some room to actually draw in the sleeves after tightening up the lines for the front of the shirt, so I went ahead.\n- What scares me right now is how do I make the shirt look appealing?\n  - I currently don't have enough information to judge how it will look in the end, so I won't worry about it until I put in some shadow and light. In the reference I used it was a dark colored plaid.\n\n> Progress as of 2021-07-13\n![](/assets/images/2021-07-14-22-44-19.png)\n\n2021-07-14 22:44\n- HANDS, an idea. \n  - take pictures of my own hand. with every combination of finger fold-iage(?) x (palm up / down / three-fourth view)\n  - draw all of it and make note along the way.\n- Generalizing this and conjecturing:\n  - Would picking a subject and brute-forcing it pedantically be a good way to improve?\n  - May relate to the concept of _deliberate practice_.\n\n2021-07-18 23:42\n- I think pedantically trying to fix what looks bad lead to making my lines less organic and awkward.\n  - After I'm happy with the proportions I should go over the entire line work and simplify the lines that shouldn't have too much detail.\n- Left sleeve looks like it should be placed a bit to the back so that the torso doesn't look too tilted towards the viewer. It should also obstruct part of the back so that with the current tilt it doesn't look like the trapezius is overly developed.\n- The opening of the shirt should be shifted a bit towards the left arm so that it is centered with the pants.\n- Drawing a box for the torso was helpful in figuring out what elements of it was misplaced.\n\n> Illustration of points mentioned above\n![](/assets/images/2021-07-18-23-53-18.png)\n\n\n2021-07-19 00:04\n- I think the proportions are good for now.\n- The next step is to decide if I want to place this in a scene or keep it as a pin up and start blocking in the basic colors.\n- I can always make it a pin up and then later start here and branch out to a full scene.\n- I think it's good to think about what's gonna go into the basket and then figure out what scene it should become.\n\n> After adjustment vs. overlap vs. before adjustment\n![](/assets/images/2021-07-19-00-03-35.png)\n","n":0.032}}},{"i":90,"$":{"0":{"v":"Human Anatomy","n":0.707},"1":{"v":"\n# Human anatomy\n\n> Notes on human anatomy.\n\n\n","n":0.378}}}]}
